#### ForceVector3 Property

---

|  |
| --- |
| AreaLoad Class   See Also |

The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ ForceVector3 { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ForceVector3 As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ ForceVector3 { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

The default force unit is kN/m^2 for metric, and ksf for imperial. Use UnitUtils class methods to convert value from or to internal units.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace

#### NPerMmSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol N/mmÂ², indicating unit Newtons per square millimeter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NPerMmSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NPerMmSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NPerMmSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### ChangePanelType Method

---

|  |
| --- |
| CurtainGrid Class   See Also |

Change the type of a curtain panel.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Element ChangePanelType( 	Element panel, 	ElementType newSymbol ) ``` |

| Visual Basic |
| --- |
| ``` Public Function ChangePanelType ( _ 	panel As Element, _ 	newSymbol As ElementType _ ) As Element ``` |

| Visual C++ |
| --- |
| ``` public: Element^ ChangePanelType( 	Element^ panel,  	ElementType^ newSymbol ) ``` |

#### Parameters

panel
:   Type:  Autodesk.Revit.DB Element
     The panel to be changed, it can be a type of  Panel  or  Wall  .

newSymbol
:   Type:  Autodesk.Revit.DB ElementType
     The new symbol, it may be of  PanelType  or  WallType  when the panel is hosted in a curtain wall. The new symbol can only be of type  PanelType  if the Panel is hosted in a curtain system.

#### Return Value

If operation succeeds, the modified panel element is returned.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the input symbol can't be used for the panel. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the type change failed. |

# See Also

CurtainGrid Class

Autodesk.Revit.DB Namespace

#### ExtraCheckBoxText Property

---

|  |
| --- |
| TaskDialog Class   See Also |

ExtraCheckBoxText is used to label the extra checkbox.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string ExtraCheckBoxText { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExtraCheckBoxText As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ExtraCheckBoxText { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

If ExtraCheckBoxText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasExtraCheckBoxChecked() method.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the TaskDialog also has EnableMarqueeProgressBar set as the two cannot coincide in the same TaskDialog. |

# See Also

TaskDialog Class

Autodesk.Revit.UI Namespace

#### Material Property

---

|  |
| --- |
| Category Class   See Also |

Retrieves or changes the material of the category.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Material Material { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Material As Material 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Material^ Material { 	Material^ get (); 	void set (Material^ value); } ``` |

#### Field Value

   a null reference (  Nothing  in Visual Basic)  if this category does not have a material.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: material cannot be set for annotation categories. |

# See Also

Category Class

Autodesk.Revit.DB Namespace

#### TrussNotJoinedWebs Property

---

|  |
| --- |
| BuiltInFailures TrussFailures Class   See Also |

The current edits are causing some webs to disjoin. The truss layout family requires additional constraints to maintain these joins.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TrussNotJoinedWebs { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TrussNotJoinedWebs As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TrussNotJoinedWebs { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures TrussFailures Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| FormArrayIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

FormArrayIterator Class

Autodesk.Revit.DB Namespace

#### MeshTriangle Class

---

|  |
| --- |
| Members   See Also |

One triangle of a mesh.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class MeshTriangle ``` |

| Visual Basic |
| --- |
| ``` Public Class MeshTriangle ``` |

| Visual C++ |
| --- |
| ``` public ref class MeshTriangle ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB MeshTriangle

# See Also

MeshTriangle Members

Autodesk.Revit.DB Namespace

#### SetEmissiveColor Method

---

|  |
| --- |
| EffectInstance Class   See Also |

Sets the emissive color parameter of the effect instance.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetEmissiveColor( 	Color color ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetEmissiveColor ( _ 	color As Color _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetEmissiveColor( 	Color^ color ) ``` |

#### Parameters

color
:   Type:  Autodesk.Revit.DB Color
     The emissive color value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### IsValidObject Property

---

|  |
| --- |
| SATExportOptions Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

SATExportOptions Class

Autodesk.Revit.DB Namespace

#### RoofType Class

---

|  |
| --- |
| Members   See Also |

Represents a specific type of roof.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class RoofType : HostObjAttributes ``` |

| Visual Basic |
| --- |
| ``` Public Class RoofType _ 	Inherits HostObjAttributes ``` |

| Visual C++ |
| --- |
| ``` public ref class RoofType : public HostObjAttributes ``` |

# Remarks

All roof type objects available in the project can be retrieved from the Document object via the RoofTypes property. Every Roof object has a RoofType property that returns a RoofType object representing the type. This same RoofType property can also be used to change the type of the roof by setting it to a different type.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB HostObjAttributes
  Autodesk.Revit.DB RoofType

# See Also

RoofType Members

Autodesk.Revit.DB Namespace

#### JoinType Property

---

|  |
| --- |
| LocationCurve Class   See Also |

Get/change the type of the join at the specified end.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public JoinType this[ 	int end ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property JoinType ( _ 	end As Integer _ ) As JoinType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property JoinType JoinType[int end] { 	JoinType get (int end); 	void set (int end, JoinType value); } ``` |

#### Parameters

end
:   Type:  System Int32
     The end of the location curve driver under question.

# Remarks

This property allows to get join type of wall and concrete beam and to set wall's join type. The new join type is expected to be different from the current one for this end.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The element is neither a wall nor a concrete beam when it tries to get the property. The element is not a wall when it tries to set the property. |
| Autodesk.Revit.Exceptions InvalidOperationException | A failure occurred while attempting to set the new type. |

# See Also

LocationCurve Class

Autodesk.Revit.DB Namespace

#### ThermalGradientCoefficientForMoistureCapacity Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Thermal Gradient Coefficient for Moisture Capacity, in discipline Energy.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ThermalGradientCoefficientForMoistureCapacity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ThermalGradientCoefficientForMoistureCapacity As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ThermalGradientCoefficientForMoistureCapacity { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| WireSet Class   See Also |

Test to see if the set is empty.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the set is empty then True will be returned, otherwise False.

# See Also

WireSet Class

Autodesk.Revit.DB.Electrical Namespace

#### Dispose Method

---

|  |
| --- |
| StructuralSectionsServiceData Class   See Also |

Releases all resources used by the  StructuralSectionsServiceData

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

StructuralSectionsServiceData Class

Autodesk.Revit.DB.Structure Namespace

#### RebarInternalMultiplanarEndConnector Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"INTERNAL: Multiplanar End Connector"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarInternalMultiplanarEndConnector { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarInternalMultiplanarEndConnector As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarInternalMultiplanarEndConnector { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetReferenceCallouts Method

---

|  |
| --- |
| View Class   See Also |

Returns element ids of all reference callouts in the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetReferenceCallouts() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetReferenceCallouts As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetReferenceCallouts() ``` |

#### Return Value

Element ids of all reference callouts in the view.

# See Also

View Class

Autodesk.Revit.DB Namespace

#### RbsElecApparentLoadPhase3 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Apparent Load Phase 3"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecApparentLoadPhase3 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecApparentLoadPhase3 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecApparentLoadPhase3 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PoundsMassPerPoundDegreeFahrenheit Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Pounds mass per pound degree Fahrenheit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PoundsMassPerPoundDegreeFahrenheit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PoundsMassPerPoundDegreeFahrenheit As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PoundsMassPerPoundDegreeFahrenheit { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### GetElementFilterFromRule Method (PerformanceAdviserRuleId, Document)

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

Retrieves a filter to restrict elements to be checked.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementFilter GetElementFilterFromRule( 	PerformanceAdviserRuleId id, 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetElementFilterFromRule ( _ 	id As PerformanceAdviserRuleId, _ 	document As Document _ ) As ElementFilter ``` |

| Visual C++ |
| --- |
| ``` public: ElementFilter^ GetElementFilterFromRule( 	PerformanceAdviserRuleId^ id,  	Document^ document ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.DB PerformanceAdviserRuleId
     The rule id to get information for.

document
:   Type:  Autodesk.Revit.DB Document
     Document for which performance problems are being checked.

#### Return Value

The filter to restrict elements to be checked.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PerformanceAdviser Class

GetElementFilterFromRule Overload

Autodesk.Revit.DB Namespace

#### GeometryPositioning Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Geometric Position"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GeometryPositioning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GeometryPositioning As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GeometryPositioning { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### ValueAtPoint Class

---

|  |
| --- |
| Members   See Also |

Stores values at one domain point. Each value corresponds to a "measurement" for which this value was calculated.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class ValueAtPoint : ValueAtPointBase ``` |

| Visual Basic |
| --- |
| ``` Public Class ValueAtPoint _ 	Inherits ValueAtPointBase ``` |

| Visual C++ |
| --- |
| ``` public ref class ValueAtPoint : public ValueAtPointBase ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ValueAtPointBase
  Autodesk.Revit.DB.Analysis ValueAtPoint

# See Also

ValueAtPoint Members

Autodesk.Revit.DB.Analysis Namespace

#### BaseEquipment Property

---

|  |
| --- |
| MEPSystem Class   See Also |

The base panel or equipment of the system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyInstance BaseEquipment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property BaseEquipment As FamilyInstance 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property FamilyInstance^ BaseEquipment { 	FamilyInstance^ get (); } ``` |

# See Also

MEPSystem Class

Autodesk.Revit.DB Namespace

#### Erase Method

---

|  |
| --- |
| SpaceSet Class   See Also |

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Erase( 	Space item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Erase ( _ 	item As Space _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: virtual int Erase( 	Space^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB.Mechanical Space

# See Also

SpaceSet Class

Autodesk.Revit.DB.Mechanical Namespace

#### TotalDepth Property

---

|  |
| --- |
| StairsRunType Class   See Also |

The total depth of the stairs run, only available for monolithic stairs run.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double TotalDepth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TotalDepth As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double TotalDepth { 	double get (); } ``` |

# See Also

StairsRunType Class

Autodesk.Revit.DB.Architecture Namespace

#### GetRuleDescription Method (Int32)

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

Retrieves the description of the rule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public string GetRuleDescription( 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRuleDescription ( _ 	index As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetRuleDescription( 	int index ) ``` |

#### Parameters

index
:   Type:  System Int32
     The rule index to get information for.

#### Return Value

The description of the rule.

# See Also

PerformanceAdviser Class

GetRuleDescription Overload

Autodesk.Revit.DB Namespace

#### Transformed Property

---

|  |
| --- |
| Mesh Class   See Also |

Transforms this mesh and returns the result.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Mesh this[ 	Transform transform ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Transformed ( _ 	transform As Transform _ ) As Mesh 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Mesh^ Transformed[Transform^ transform] { 	Mesh^ get (Transform^ transform); } ``` |

#### Parameters

transform
:   Type:  Autodesk.Revit.DB Transform
     The transformation used to transform the profile.

#### Return Value

The transformed mesh.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the handle of the specified transformation is    a null reference (  Nothing  in Visual Basic)  . |

# See Also

Mesh Class

Autodesk.Revit.DB Namespace

#### RuleString Property

---

|  |
| --- |
| FilterStringRule Class   See Also |

The user-supplied string against which strings from a Revit document will be tested.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string RuleString { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RuleString As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ RuleString { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

FilterStringRule Class

Autodesk.Revit.DB Namespace

#### Millivolts Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Millivolts.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Millivolts { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Millivolts As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Millivolts { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### General Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"General"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId General { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property General As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ General { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### FailedUpdateCurveChain Property

---

|  |
| --- |
| BuiltInFailures GeometryFailures Class   See Also |

Failed to update curve chain.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FailedUpdateCurveChain { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FailedUpdateCurveChain As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FailedUpdateCurveChain { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeometryFailures Class

Autodesk.Revit.DB Namespace

#### MepCondenserWaterLoop Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Condenser Water Loop"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepCondenserWaterLoop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepCondenserWaterLoop As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepCondenserWaterLoop { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BadRailProfile Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

One or more Profile Loops are invalid, probably because of self-intersection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BadRailProfile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BadRailProfile As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BadRailProfile { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### CurtaingridBeltRatioV Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Belt Measurement"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurtaingridBeltRatioV { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtaingridBeltRatioV As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurtaingridBeltRatioV { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Weight Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Weight, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Weight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Weight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Weight { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### InfillNoSlopeGlazing Property

---

|  |
| --- |
| BuiltInFailures InfillFailures Class   See Also |

Could not change type due to highlighted infilling element. 'Sloped glazing' infills are not allowed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InfillNoSlopeGlazing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InfillNoSlopeGlazing As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InfillNoSlopeGlazing { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures InfillFailures Class

Autodesk.Revit.DB Namespace

#### BtuPerLb Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol BTU/lb, indicating unit British thermal units per pound.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BtuPerLb { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BtuPerLb As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BtuPerLb { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralType Enumeration

---

|  |
| --- |
| See Also |

Represents the structural type of a family instance.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum StructuralType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StructuralType ``` |

| Visual C++ |
| --- |
| ``` public enum class StructuralType ``` |

# Members

| Member name | Description |
| --- | --- |
| NonStructural | Non-Structural |
| Beam | Structural Beam |
| Brace | Structural Brace |
| Column | Structural Column |
| Footing | Structural Footing |
| UnknownFraming | Unknown Framing |

# See Also

Autodesk.Revit.DB.Structure Namespace

#### GetIssues Method

---

|  |
| --- |
| MeshFromGeometryOperationResult Class   See Also |

Returns the array of issues encountered while building a mesh.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IList<MeshFromGeometryOperationIssue> GetIssues() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetIssues As IList(Of MeshFromGeometryOperationIssue) ``` |

| Visual C++ |
| --- |
| ``` public: IList<MeshFromGeometryOperationIssue>^ GetIssues() ``` |

#### Return Value

Array of issues encountered while building a mesh.

# See Also

MeshFromGeometryOperationResult Class

Autodesk.Revit.DB Namespace

#### GetInstanceTransform Method

---

|  |
| --- |
| ReferenceWithContext Class   See Also |

Gets the transform of the instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Transform GetInstanceTransform() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetInstanceTransform As Transform ``` |

| Visual C++ |
| --- |
| ``` public: Transform^ GetInstanceTransform() ``` |

#### Return Value

The transform of an instance when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).

# See Also

ReferenceWithContext Class

Autodesk.Revit.DB Namespace

#### GetRequesters Method

---

|  |
| --- |
| WorksharingTooltipInfo Class   See Also |

The ordered list of unique user names of users who have outstanding editing requests for the specified element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<string> GetRequesters() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRequesters As IList(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: IList<String^>^ GetRequesters() ``` |

#### Return Value

The ordered list of unique user names.

# Remarks

The list is ordered by who placed the earliest request. If the list is empty it means that nobody is currently requesting the specified element.

# See Also

WorksharingTooltipInfo Class

Autodesk.Revit.DB Namespace

#### CurrentUser Property

---

|  |
| --- |
| CentralModelContentionException Class   See Also |

Retrieves current user name.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public string CurrentUser { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CurrentUser As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ CurrentUser { 	String^ get (); } ``` |

# See Also

CentralModelContentionException Class

Autodesk.Revit.Exceptions Namespace

#### StructuralSectionIshapeBoltSpacingTwoRows Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bolt Spacing Two Rows"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionIshapeBoltSpacingTwoRows { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionIshapeBoltSpacingTwoRows As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionIshapeBoltSpacingTwoRows { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DisplayedStartStation Property

---

|  |
| --- |
| Alignment Class   See Also |

Specifies the station at which the alignment's display starts, in Revit internal model units (standard Imperial feet).

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public double DisplayedStartStation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DisplayedStartStation As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double DisplayedStartStation { 	double get (); } ``` |

# Remarks

This station is within the alignment's geometric definition range (  StartStation  ,  EndStation  ).

# See Also

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace

#### HasStructuralDeck Property

---

|  |
| --- |
| CompoundStructure Class   See Also |

Checks if the compound structure has a structural deck.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool HasStructuralDeck { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HasStructuralDeck As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool HasStructuralDeck { 	bool get (); } ``` |

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### ViewId Property

---

|  |
| --- |
| CADLinkOptions Class   See Also |

The id of the view to use as the link's reference view, if the reference view has been deleted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public ElementId ViewId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ViewId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ViewId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

CADLinkOptions Class

Autodesk.Revit.DB Namespace

#### ActualReturnAirflow Property

---

|  |
| --- |
| Space Class   See Also |

Get the Actual Return Airflow of the Space.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public double ActualReturnAirflow { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ActualReturnAirflow As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ActualReturnAirflow { 	double get (); } ``` |

# Remarks

This property is used to get the Actual Return Airflow (Unit: CFM) of the Space.

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace

#### CantileverLength Property

---

|  |
| --- |
| StructuralSectionConcreteCross Class   See Also |

Flange cantilever length.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double CantileverLength { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CantileverLength As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double CantileverLength { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionConcreteCross Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### GetHookOffsetLength Method

---

|  |
| --- |
| RebarBarType Class   See Also |

Identifies the hook offset length for a hook type

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public double GetHookOffsetLength( 	ElementId hookId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHookOffsetLength ( _ 	hookId As ElementId _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetHookOffsetLength( 	ElementId^ hookId ) ``` |

#### Parameters

hookId
:   Type:  Autodesk.Revit.DB ElementId
     id of the hook type

#### Return Value

The hook offset length for a hook type

# Remarks

If the AutoCalcHookLengths property is turned off, the default hook offset length will be returned

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | the rebar hook type id hookId is not valid -or- the hook specified by id hookId doesn't have valid offset length -or- The element hookId does not exist in the document containing this RebarBarType -or- the hook specified by id hookId doesn't have valid default offset length |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The document containing this RebarBarType is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The element is a member of a loaded family. -or- The element is a member of a group type that is not being edited. -or- hookId is a member of a loaded family. -or- hookId is a member of a group type that is not being edited. |

# See Also

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace

#### Current Property

---

|  |
| --- |
| ParameterSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

ParameterSetIterator Class

Autodesk.Revit.DB Namespace

#### ClearCoverOther Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Rebar Cover - Other Faces"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ClearCoverOther { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ClearCoverOther As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ClearCoverOther { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SpatialElementTag Class

---

|  |
| --- |
| Members   See Also |

A tag attached to a SpatialElement (room, space or area) in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public class SpatialElementTag : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class SpatialElementTag _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class SpatialElementTag : public Element ``` |

# Remarks

SpatialElementTag is the base class for RoomTag, SpaceTag and AreaTag. Zone tag is not derived from SpatialElementTag. See  IndependentTag  for more information.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB SpatialElementTag
  Autodesk.Revit.DB.Architecture RoomTag
  Autodesk.Revit.DB AreaTag
  Autodesk.Revit.DB.Mechanical SpaceTag

# See Also

SpatialElementTag Members

Autodesk.Revit.DB Namespace

#### SetRodLength Method

---

|  |
| --- |
| FabricationRodInfo Class   See Also |

Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool SetRodLength( 	int rodIndex, 	double newLength ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetRodLength ( _ 	rodIndex As Integer, _ 	newLength As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool SetRodLength( 	int rodIndex,  	double newLength ) ``` |

#### Parameters

rodIndex
:   Type:  System Int32
     The rod index.

newLength
:   Type:  System Double

#### Return Value

returns true if it worked.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |
| Autodesk.Revit.Exceptions InvalidOperationException | The rod length cannot be set because the hanger is set to automatically host to other elements. |

# See Also

FabricationRodInfo Class

Autodesk.Revit.DB Namespace

#### ContourLabelsRelativeBase Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Relative Base"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ContourLabelsRelativeBase { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ContourLabelsRelativeBase As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ContourLabelsRelativeBase { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotCopyRevolveAxisWarn Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

The axis cannot be copied.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyRevolveAxisWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyRevolveAxisWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyRevolveAxisWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### IsDetailed Method

---

|  |
| --- |
| StructuralConnectionHandlerType Class   See Also |

Checks if StructuralConnectionHandlerType is detailed.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool IsDetailed() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsDetailed As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsDetailed() ``` |

#### Return Value

True if StructuralConnectionHandlerType is detailed.

# See Also

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace

#### LocationPoint Class

---

|  |
| --- |
| Members   Example   See Also |

Provides location functionality for all elements that have a single insertion point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class LocationPoint : Location ``` |

| Visual Basic |
| --- |
| ``` Public Class LocationPoint _ 	Inherits Location ``` |

| Visual C++ |
| --- |
| ``` public ref class LocationPoint : public Location ``` |

# Remarks

The location point objects adds additional functionality to its base location object class. This includes setting the elements location to a specific point and retrieving its rotation around its insertion point. Inplace families do not have a single insertion point and therefore do not have meaningful LocationPoint data.

# Examples

 Copy  C#

```
void LocationInformation(LocationPoint position)
{
    String prompt = "The selected column location information:";
    prompt += "\nPoint:  (" + position.Point.X + ", "
            + position.Point.Y + ", " + position.Point.Z + ")";
    prompt += "\nRotation: " + position.Rotation;

    TaskDialog.Show("Revit",prompt);
}

bool LocationRotate(Autodesk.Revit.ApplicationServices.Application application, Autodesk.Revit.DB.Element element)
{
    bool rotated = false;
    LocationPoint location = element.Location as LocationPoint;

    if (null != location)
    {
        XYZ aa = location.Point;
        XYZ cc = new XYZ(aa.X, aa.Y, aa.Z + 10);
        Line axis = Line.CreateBound(aa,cc);
        rotated = location.Rotate(axis, Math.PI / 2.0);
    }

    return rotated;
}
```

 Copy  VB.NET

```
Private Sub LocationInformation(position As LocationPoint)
    Dim prompt As [String] = "The selected column location information:"
    prompt += vbLf & "Point:  (" & Convert.ToString(position.Point.X) & ", " & Convert.ToString(position.Point.Y) & ", " & Convert.ToString(position.Point.Z) & ")"
    prompt += vbLf & "Rotation: " & Convert.ToString(position.Rotation)

    TaskDialog.Show("Revit", prompt)
End Sub

Private Function LocationRotate(application As Autodesk.Revit.ApplicationServices.Application, element As Autodesk.Revit.DB.Element) As Boolean
    Dim rotated As Boolean = False
    Dim location As LocationPoint = TryCast(element.Location, LocationPoint)

    If location IsNot Nothing Then
        Dim aa As XYZ = location.Point
        Dim cc As New XYZ(aa.X, aa.Y, aa.Z + 10)
        Dim axis As Line = Line.CreateBound(aa, cc)
        rotated = location.Rotate(axis, Math.PI / 2.0)
    End If

    Return rotated
End Function
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB Location
  Autodesk.Revit.DB LocationPoint

# See Also

LocationPoint Members

Autodesk.Revit.DB Namespace

#### RebarShape Class

---

|  |
| --- |
| Members   See Also |

RebarShape specifies the shape type for a Rebar instance.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public class RebarShape : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class RebarShape _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class RebarShape : public ElementType ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Structure RebarShape

# See Also

RebarShape Members

Autodesk.Revit.DB.Structure Namespace

#### IFCLink Property

---

|  |
| --- |
| ExternalResourceTypes BuiltInExternalResourceTypes Class   See Also |

An external resource type representing IFC links.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalResourceType IFCLink { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IFCLink As ExternalResourceType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalResourceType^ IFCLink { 	ExternalResourceType^ get (); } ``` |

# See Also

ExternalResourceTypes BuiltInExternalResourceTypes Class

Autodesk.Revit.DB Namespace

#### ViewExported Event

---

|  |
| --- |
| Application Class   See Also |

Subscribe to the ViewExported event to be notified immediately after Revit has finished exporting a view of the document.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public event EventHandler<ViewExportedEventArgs> ViewExported ``` |

| Visual Basic |
| --- |
| ``` Public Event ViewExported As EventHandler(Of ViewExportedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<ViewExportedEventArgs^>^ ViewExported { 	void add (EventHandler<ViewExportedEventArgs^>^ value); 	void remove (EventHandler<ViewExportedEventArgs^>^ value); } ``` |

# Remarks

This event is raised immediately after Revit has finished exporting a view of the document. It is raised only during accelerated export jobs, in which views are exported in parallel using a background process. Accelerated export only occurs when exporting to DWF formats and not combining views into a single file.

It is raised even when view exporting failed.

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' field in event's argument to see whether the action was successful or not.

This event is not cancellable, for the process of view exporting has already been finished.

If the action was not successful, the document may not be modified and new transactions may not be started.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### LineWidth Property

---

|  |
| --- |
| LineProperties Class   See Also |

The current width (thickness) of the pen stroke when drawing lines/curves.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double LineWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LineWidth As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double LineWidth { 	double get (); } ``` |

# See Also

LineProperties Class

Autodesk.Revit.DB Namespace

#### GetDistributionPath Method

---

|  |
| --- |
| RebarContainerItem Class   See Also |

The distribution path of a rebar set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public Line GetDistributionPath() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDistributionPath As Line ``` |

| Visual C++ |
| --- |
| ``` public: Line^ GetDistributionPath() ``` |

#### Return Value

A line beginning at (0, 0, 0) and representing the direction and length of the set.

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### CurtainPanelNotBelongsToElement Property

---

|  |
| --- |
| BuiltInFailures CurtainGridFamilyFailures Class   See Also |

Curtain element Panel doesn't belong to Curtain element. In merging, you must select the version of a Curtain element that has had Panels added to it.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CurtainPanelNotBelongsToElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtainPanelNotBelongsToElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CurtainPanelNotBelongsToElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainGridFamilyFailures Class

Autodesk.Revit.DB Namespace

#### FloorParamSpanDirection Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Span Direction"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FloorParamSpanDirection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FloorParamSpanDirection As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FloorParamSpanDirection { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WireDiameter Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Wire Diameter, in discipline Electrical.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WireDiameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WireDiameter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WireDiameter { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### RefersToExternalResourceReference Method

---

|  |
| --- |
| Element Class   See Also |

Determines whether this Element uses external resources associated with a specified external resource type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool RefersToExternalResourceReference( 	ExternalResourceType resourceType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function RefersToExternalResourceReference ( _ 	resourceType As ExternalResourceType _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool RefersToExternalResourceReference( 	ExternalResourceType^ resourceType ) ``` |

#### Parameters

resourceType
:   Type:  Autodesk.Revit.DB ExternalResourceType
     The desired external resource type.

#### Return Value

Returns true if this Element uses external resources associated with the specified external resource type; otherwise, false.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### PipingTemperature Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Temperature, in discipline Piping.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PipingTemperature { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PipingTemperature As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PipingTemperature { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ReinforcementAbbreviationTag Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ReinforcementAbbreviationTag Class

Autodesk.Revit.DB.Structure Namespace

#### ApparentLoad Property

---

|  |
| --- |
| AreaBasedLoadData Class   See Also |

The electrical apparent load of the area based load.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public double ApparentLoad { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ApparentLoad As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ApparentLoad { 	double get (); } ``` |

# See Also

AreaBasedLoadData Class

Autodesk.Revit.DB.Electrical Namespace

#### AddBendVariableRadius Method

---

|  |
| --- |
| RebarShapeDefinitionBySegments Class   See Also |

Specify a variable-radius bend.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void AddBendVariableRadius( 	int vertexIndex, 	RebarShapeVertexTurn turn, 	RebarShapeBendAngle angle, 	ElementId paramId, 	bool measureIncludingBarThickness ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddBendVariableRadius ( _ 	vertexIndex As Integer, _ 	turn As RebarShapeVertexTurn, _ 	angle As RebarShapeBendAngle, _ 	paramId As ElementId, _ 	measureIncludingBarThickness As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddBendVariableRadius( 	int vertexIndex,  	RebarShapeVertexTurn turn,  	RebarShapeBendAngle angle,  	ElementId^ paramId,  	bool measureIncludingBarThickness ) ``` |

#### Parameters

vertexIndex
:   Type:  System Int32
     Index of the vertex (1 to NumberOfVertices - 2).

turn
:   Type:  Autodesk.Revit.DB.Structure RebarShapeVertexTurn
     Specify turn direction (RebarShapeVertexTurn::Left or RebarShapeVertexTurn::Right).

angle
:   Type:  Autodesk.Revit.DB.Structure RebarShapeBendAngle
     Specify whether the bend is acute, obtuse, etc.

paramId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a parameter driving the radius.

measureIncludingBarThickness
:   Type:  System Boolean
     If true, the radius is measured to the outside of the bend; if false, it is measured to the inside.

# Remarks

You must add a bend between each two segments.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | vertexIndex is not between 0 and NumberOfVertices. -or- paramId is not the id of a shared parameter in the current document, or its unit type is not UT\_Reinforcement\_Length or UT\_Angle. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

RebarShapeDefinitionBySegments Class

Autodesk.Revit.DB.Structure Namespace

#### Dispose Method

---

|  |
| --- |
| DesignToFabricationConverter Class   See Also |

Releases all resources used by the  DesignToFabricationConverter

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace

#### GetPointLineZone Method (UV)

---

|  |
| --- |
| FillGrid Class   See Also |

Gets the index of fill grid line closest to the input 2d point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public int GetPointLineZone( 	UV point ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPointLineZone ( _ 	point As UV _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetPointLineZone( 	UV^ point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB UV
     Input point.

#### Return Value

The index of fill grid line.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FillGrid Class

GetPointLineZone Overload

Autodesk.Revit.DB Namespace

#### Contains Method

---

|  |
| --- |
| ParameterSet Class   See Also |

Tests for the existence of a parameter within the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Contains( 	Parameter item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Contains ( _ 	item As Parameter _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Contains( 	Parameter^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB Parameter
     The parameter to be searched for.

#### Return Value

The Contains method returns True if the parameter is within the set, otherwise False.

# See Also

ParameterSet Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| DocumentDifference Class   See Also |

Releases all resources used by the  DocumentDifference

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

DocumentDifference Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| TextNoteOptions Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

TextNoteOptions Class

Autodesk.Revit.DB Namespace

#### IsADirectContext3DHandleCategory Method

---

|  |
| --- |
| DirectContext3DDocumentUtils Class   See Also |

Checks whether the provided category ID is one of the categories used by DirectContext3D handle elements.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static bool IsADirectContext3DHandleCategory( 	ElementId categoryId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsADirectContext3DHandleCategory ( _ 	categoryId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsADirectContext3DHandleCategory( 	ElementId^ categoryId ) ``` |

#### Parameters

categoryId
:   Type:  Autodesk.Revit.DB ElementId
     The category ID to check.

#### Return Value

True, if the category is valid for DirectContext3D handle elements, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectContext3DDocumentUtils Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### BentFabricBendDirection Property

---

|  |
| --- |
| FabricSheet Class   See Also |

Specifies which wire direction of the fabric sheet is bent.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public BentFabricBendDirection BentFabricBendDirection { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BentFabricBendDirection As BentFabricBendDirection 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property BentFabricBendDirection BentFabricBendDirection { 	BentFabricBendDirection get (); 	void set (BentFabricBendDirection value); } ``` |

# Remarks

This parameter applies only to bent fabric sheets.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: the data-setting method is not applicable to fabric sheets that are flat |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidObjectException | When setting this property: The data-setting method is not applicable to fabric sheets that are flat. |

# See Also

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace

#### SpatialFieldManager Class

---

|  |
| --- |
| Members   Example   See Also |

Exposes all API for an external analysis application. Its primary role is creation, deletion and modification of SpatialFieldElement elements.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class SpatialFieldManager : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class SpatialFieldManager _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class SpatialFieldManager : public Element ``` |

# Examples

 Copy  C#

```
Document doc = commandData.Application.ActiveUIDocument.Document;
UIDocument uiDoc = commandData.Application.ActiveUIDocument;

SpatialFieldManager sfm = SpatialFieldManager.GetSpatialFieldManager(doc.ActiveView);
if (null == sfm)
{
    sfm = SpatialFieldManager.CreateSpatialFieldManager(doc.ActiveView, 1);
}
Reference reference = uiDoc.Selection.PickObject(ObjectType.Face, "Select a face");
int idx = sfm.AddSpatialFieldPrimitive(reference);

Face face = doc.GetElement(reference).GetGeometryObjectFromReference(reference) as Face;

IList<UV> uvPts = new List<UV>();
BoundingBoxUV bb = face.GetBoundingBox();
UV min = bb.Min;
UV max = bb.Max;
uvPts.Add(new UV(min.U,min.V));
uvPts.Add(new UV(max.U,max.V));

FieldDomainPointsByUV pnts = new FieldDomainPointsByUV(uvPts);

List<double> doubleList = new List<double>();
IList<ValueAtPoint> valList = new List<ValueAtPoint>();
doubleList.Add(0);
valList.Add(new ValueAtPoint(doubleList));
doubleList.Clear();
doubleList.Add(10);
valList.Add(new ValueAtPoint(doubleList));

FieldValues vals = new FieldValues(valList);
AnalysisResultSchema resultSchema = new AnalysisResultSchema("Schema Name", "Description");
int schemaIndex = sfm.RegisterResult(resultSchema);
sfm.UpdateSpatialFieldPrimitive(idx, pnts, vals, schemaIndex);
```

 Copy  VB.NET

```
Dim doc As Document = commandData.Application.ActiveUIDocument.Document
Dim uiDoc As UIDocument = commandData.Application.ActiveUIDocument

Dim sfm As SpatialFieldManager = SpatialFieldManager.GetSpatialFieldManager(doc.ActiveView)
If sfm Is Nothing Then
    sfm = SpatialFieldManager.CreateSpatialFieldManager(doc.ActiveView, 1)
End If
Dim reference As Reference = uiDoc.Selection.PickObject(ObjectType.Face, "Select a face")
Dim idx As Integer = sfm.AddSpatialFieldPrimitive(reference)

Dim face As Face = TryCast(doc.GetElement(reference).GetGeometryObjectFromReference(reference), Face)

Dim uvPts As IList(Of UV) = New List(Of UV)()
Dim bb As BoundingBoxUV = face.GetBoundingBox()
Dim min As UV = bb.Min
Dim max As UV = bb.Max
uvPts.Add(New UV(min.U, min.V))
uvPts.Add(New UV(max.U, max.V))

Dim pnts As New FieldDomainPointsByUV(uvPts)

Dim doubleList As New List(Of Double)()
Dim valList As IList(Of ValueAtPoint) = New List(Of ValueAtPoint)()
doubleList.Add(0)
valList.Add(New ValueAtPoint(doubleList))
doubleList.Clear()
doubleList.Add(10)
valList.Add(New ValueAtPoint(doubleList))

Dim vals As New FieldValues(valList)
Dim resultSchema As New AnalysisResultSchema("Schema Name", "Description")
Dim schemaIndex As Integer = sfm.RegisterResult(resultSchema)
sfm.UpdateSpatialFieldPrimitive(idx, pnts, vals, schemaIndex)
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Analysis SpatialFieldManager

# See Also

SpatialFieldManager Members

Autodesk.Revit.DB.Analysis Namespace

#### GetParameterFormula Method

---

|  |
| --- |
| RebarShapeDefinition Class   See Also |

Return the parameter's formula, if one is associated with it.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public string GetParameterFormula( 	ElementId paramId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetParameterFormula ( _ 	paramId As ElementId _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetParameterFormula( 	ElementId^ paramId ) ``` |

#### Parameters

paramId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a parameter in the definition.

#### Return Value

The formula, or an empty string if there is no formula for the parameter.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This RebarShapeDefinition does not have a value for the parameter paramId. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarShapeDefinition Class

Autodesk.Revit.DB.Structure Namespace

#### PhyMaterialParamBending Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bending"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamBending { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamBending As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamBending { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LiquidViscosity Property

---

|  |
| --- |
| ThermalAsset Class   See Also |

The liquid viscosity of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double LiquidViscosity { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LiquidViscosity As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double LiquidViscosity { 	double get (); 	void set (double value); } ``` |

# Remarks

Values are in kilograms per feet-second (kg/(ft Â· s)) and must be non-negative.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for liquidViscosity must be non-negative. |
| Autodesk.Revit.Exceptions InapplicableDataException | When setting this property: the asset must be liquid to set this property. |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace

#### PoundsForcePerSquareFoot Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Pounds force per square foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PoundsForcePerSquareFoot { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PoundsForcePerSquareFoot As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PoundsForcePerSquareFoot { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### GetConnections Method

---

|  |
| --- |
| StairsLanding Class   See Also |

Returns information about the connections in which the stairs landing participates.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<StairsComponentConnection> GetConnections() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetConnections As IList(Of StairsComponentConnection) ``` |

| Visual C++ |
| --- |
| ``` public: IList<StairsComponentConnection^>^ GetConnections() ``` |

#### Return Value

The connections in which the stairs landing participates.

# See Also

StairsLanding Class

Autodesk.Revit.DB.Architecture Namespace

#### Dispose Method

---

|  |
| --- |
| IFCFile Class   See Also |

Releases all resources used by the  IFCFile

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

IFCFile Class

Autodesk.Revit.DB.IFC Namespace

#### AppendSequence Method

---

|  |
| --- |
| NumberingSchema Class   See Also |

Appends all elements of one numbering sequence to the end of another sequence.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void AppendSequence( 	string fromPartition, 	string toPartition ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AppendSequence ( _ 	fromPartition As String, _ 	toPartition As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AppendSequence( 	String^ fromPartition,  	String^ toPartition ) ``` |

#### Parameters

fromPartition
:   Type:  System String
     Name of the partition that determines which numbering sequence to append. The sequence must exist already, otherwise an exception will be thrown.

toPartition
:   Type:  System String
     Name of a partition into which the source sequence is going to be appended. The sequence must exist already, otherwise an exception will be thrown.

# Remarks

All numbers assigned to elements in the target sequence remain the same, but numbers in the source sequence (the one getting appended) will change. Elements that match elements in the target sequence will get the same numbers assigned. Remaining elements will get consecutive numbers in the creation order of the elements starting with the next highest number available in the target sequence.

This operation modifies the Partition parameter of all elements in the sequence that is getting appended. Therefore, all its elements must be accessible for editing, otherwise this operation will fail.

Elements can be appended only to a sequence that already exists. In order to reassign elements of one sequence to a partition that does not exist yet, use either the  MoveSequence  or  MergeSequences  methods.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The sequence fromPartition does not exist in the schema. -or- The sequence toPartition does not exist in the schema. -or- Given partition names fromPartition and toPartition must be different. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Either the schema or its document cannot be modified at present. -or- Thrown if there is an element that cannot have new value of the NUMBER\_PARTITION\_PARAM parameter assigned. It may be an indication that the element is not free to be edited at present. |

# See Also

NumberingSchema Class

Autodesk.Revit.DB Namespace

#### GetViewRange Method

---

|  |
| --- |
| ViewPlan Class   See Also |

Gets the view range.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public PlanViewRange GetViewRange() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetViewRange As PlanViewRange ``` |

| Visual C++ |
| --- |
| ``` public: PlanViewRange^ GetViewRange() ``` |

#### Return Value

The view range.

# See Also

ViewPlan Class

Autodesk.Revit.DB Namespace

#### ForwardIterator Method

---

|  |
| --- |
| SlabShapeCreaseArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual SlabShapeCreaseArrayIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As SlabShapeCreaseArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual SlabShapeCreaseArrayIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

# See Also

SlabShapeCreaseArray Class

Autodesk.Revit.DB Namespace

#### SpatialElementBoundarySubface Class

---

|  |
| --- |
| Members   See Also |

SpatialElementBoundarySubface represents the geometry boundary information of spatial element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class SpatialElementBoundarySubface : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class SpatialElementBoundarySubface _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class SpatialElementBoundarySubface : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB SpatialElementBoundarySubface

# See Also

SpatialElementBoundarySubface Members

Autodesk.Revit.DB Namespace

#### NewAreaBoundaryLine Method

---

|  |
| --- |
| Document Class   See Also |

Creates a new boundary line as an Area border.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ModelCurve NewAreaBoundaryLine( 	SketchPlane sketchPlane, 	Curve geometryCurve, 	ViewPlan areaView ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewAreaBoundaryLine ( _ 	sketchPlane As SketchPlane, _ 	geometryCurve As Curve, _ 	areaView As ViewPlan _ ) As ModelCurve ``` |

| Visual C++ |
| --- |
| ``` public: ModelCurve^ NewAreaBoundaryLine( 	SketchPlane^ sketchPlane,  	Curve^ geometryCurve,  	ViewPlan^ areaView ) ``` |

#### Parameters

sketchPlane
:   Type:  Autodesk.Revit.DB SketchPlane
     The sketch plane.

geometryCurve
:   Type:  Autodesk.Revit.DB Curve
     The geometry curve on which the boundary line are

areaView
:   Type:  Autodesk.Revit.DB ViewPlan
     The View for the new Area

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the sketch plane does not exist in the given document. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the area view does not exist in the given document. |

# See Also

Document Class

Autodesk.Revit.Creation Namespace

#### SetSourceElementIds Method

---

|  |
| --- |
| PartMaker Class   See Also |

Set the source elements for the PartMaker.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetSourceElementIds( 	ICollection<ElementId> sourceElementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetSourceElementIds ( _ 	sourceElementIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetSourceElementIds( 	ICollection<ElementId^>^ sourceElementIds ) ``` |

#### Parameters

sourceElementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     Elements to be the sources for this PartMaker.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | One or more element ids was not permitted to be a source for this PartMaker Elements should be Parts that have no PartMaker yet |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartMaker Class

Autodesk.Revit.DB Namespace

#### MustReplacePanels Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Missing Curtain Panels will be replaced with System Panels to complete command.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MustReplacePanels { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MustReplacePanels As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MustReplacePanels { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### RailPathCloseLoopForExtensionWarning Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

The rail path is closed at the start and end path point for extension creation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RailPathCloseLoopForExtensionWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailPathCloseLoopForExtensionWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RailPathCloseLoopForExtensionWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| BindingMap Class   See Also |

This method is used to remove all the items in the map.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() override ``` |

# Remarks

The method Clear inherited from base class is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown.

# See Also

BindingMap Class

Autodesk.Revit.DB Namespace

#### Orientation Property

---

|  |
| --- |
| Wall Class   See Also |

The normal vector projected from the exterior side of the wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Orientation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Orientation As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Orientation { 	XYZ^ get (); } ``` |

# See Also

Wall Class

Autodesk.Revit.DB Namespace

#### StartPercentage Property

---

|  |
| --- |
| ViewDisplayDepthCueing Class   See Also |

The start percentage defines where depth cueing starts. Values between 0 and 100.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public int StartPercentage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property StartPercentage As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int StartPercentage { 	int get (); } ``` |

# See Also

ViewDisplayDepthCueing Class

Autodesk.Revit.DB Namespace

#### BaseEquipmentConnector Property

---

|  |
| --- |
| MechanicalSystem Class   See Also |

The connector within the base equipment which is used to connect with the system.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Connector BaseEquipmentConnector { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BaseEquipmentConnector As Connector 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Connector^ BaseEquipmentConnector { 	Connector^ get (); 	void set (Connector^ value); } ``` |

# Remarks

Assigning    a null reference (  Nothing  in Visual Basic)  to the base equipment connector will disconnect the base equipment from the system.

# Remarks

Setting this property will regenerate the document even in manual regeneration mode.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when assigning a connector which is used in a system, or when the connector's owner is not of type 'mechanical equipment'. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the set operation failed. |

# See Also

MechanicalSystem Class

Autodesk.Revit.DB.Mechanical Namespace

#### GetHookOrientation Method

---

|  |
| --- |
| Rebar Class   See Also |

Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public RebarHookOrientation GetHookOrientation( 	int iEnd ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHookOrientation ( _ 	iEnd As Integer _ ) As RebarHookOrientation ``` |

| Visual C++ |
| --- |
| ``` public: RebarHookOrientation GetHookOrientation( 	int iEnd ) ``` |

#### Parameters

iEnd
:   Type:  System Int32
     0 for the start hook, 1 for the end hook.

#### Return Value

Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | iEnd must be 0 or 1. |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### CanFilterByGlobalParameters Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Checks whether a field can be used with a global parameter-based filter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool CanFilterByGlobalParameters( 	ScheduleFieldId fieldId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanFilterByGlobalParameters ( _ 	fieldId As ScheduleFieldId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanFilterByGlobalParameters( 	ScheduleFieldId^ fieldId ) ``` |

#### Parameters

fieldId
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The ID of the field to check.

#### Return Value

True if the field can be used with a global parameter-based filter, false otherwise.

# Remarks

The global parameter-based filter types are IsAsociatedWith, IsNotAssociatedWith.

Only parameters which have a compatible type with at least one existing global parameter can be filtered.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### SetLockCallback Method

---

|  |
| --- |
| TransactWithCentralOptions Class   See Also |

Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetLockCallback( 	ICentralLockedCallback lockCallback ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLockCallback ( _ 	lockCallback As ICentralLockedCallback _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLockCallback( 	ICentralLockedCallback^ lockCallback ) ``` |

#### Parameters

lockCallback
:   Type:  Autodesk.Revit.DB ICentralLockedCallback

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

TransactWithCentralOptions Class

Autodesk.Revit.DB Namespace

#### AcceptableName Method

---

|  |
| --- |
| SchemaBuilder Class   See Also |

Checks whether a string is an acceptable name for a Schema or a Field.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool AcceptableName( 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AcceptableName ( _ 	name As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AcceptableName( 	String^ name ) ``` |

#### Parameters

name
:   Type:  System String
     The string to check.

#### Return Value

True if the name is acceptable.

# Remarks

For interoperability, names are required to be usable as C++ identifiers. The allowable characters are ASCII letters, numbers (except the first character) and underscore. The length must be between 1 and 247 characters.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### HasBinding Property

---

|  |
| --- |
| RevitCommandId Class   See Also |

Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool HasBinding { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HasBinding As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool HasBinding { 	bool get (); } ``` |

# Remarks

This will not indicate if one or more applications have subscribed to the BeforeExecuted event, as this event is not limited to a single subscriber.

# See Also

RevitCommandId Class

Autodesk.Revit.UI Namespace

#### RbsEnergyAnalysisProjectPhaseParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Project Phase"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsEnergyAnalysisProjectPhaseParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsEnergyAnalysisProjectPhaseParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsEnergyAnalysisProjectPhaseParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetSolidInView Method

---

|  |
| --- |
| RebarContainer Class   See Also |

Sets this RebarContainer element is shown as solid in the given 3D view.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The RebarContainer will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")] public void SetSolidInView( 	View3D view, 	bool solid ) ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The RebarContainer will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")> _ Public Sub SetSolidInView ( _ 	view As View3D, _ 	solid As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The RebarContainer will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")] public: void SetSolidInView( 	View3D^ view,  	bool solid ) ``` |

#### Parameters

view
:   Type:  Autodesk.Revit.DB View3D
     The 3D view element

solid
:   Type:  System Boolean
     True if this RebarContainer element is shown as solid in the given 3D view, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | This rebar container element doesn't have valid visibility data. |

# See Also

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace

#### EnergyAnalysisBuildingOperatingSchedule Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Building Operating Schedule"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EnergyAnalysisBuildingOperatingSchedule As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ EnergyAnalysisBuildingOperatingSchedule { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CantMakeFillets Property

---

|  |
| --- |
| BuiltInFailures RebarFailures Class   See Also |

The bar cannot be bent in that shape. Check the bending diameter and the bar type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CantMakeFillets { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CantMakeFillets As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CantMakeFillets { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarFailures Class

Autodesk.Revit.DB Namespace

#### SpaceResolutionOutOfRange Property

---

|  |
| --- |
| BuiltInFailures EnergyAnalysisFailures Class   See Also |

Voxel size is out of range.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SpaceResolutionOutOfRange { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpaceResolutionOutOfRange As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SpaceResolutionOutOfRange { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EnergyAnalysisFailures Class

Autodesk.Revit.DB Namespace

#### WallId Property

---

|  |
| --- |
| WallFoundation Class   See Also |

Returns the id of the host wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public ElementId WallId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property WallId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ WallId { 	ElementId^ get (); } ``` |

# See Also

WallFoundation Class

Autodesk.Revit.DB Namespace

#### LoadTypeBase Class

---

|  |
| --- |
| Members   See Also |

An object that represents a Load type.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class LoadTypeBase : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class LoadTypeBase _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class LoadTypeBase : public ElementType ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Structure LoadTypeBase
  Autodesk.Revit.DB.Structure AreaLoadType
  Autodesk.Revit.DB.Structure LineLoadType
  Autodesk.Revit.DB.Structure PointLoadType

# See Also

LoadTypeBase Members

Autodesk.Revit.DB.Structure Namespace

#### RbsElecCircuitNumberOfElementsParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Number of Elements"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecCircuitNumberOfElementsParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecCircuitNumberOfElementsParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecCircuitNumberOfElementsParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CommonTintColor Property

---

|  |
| --- |
| Ceramic Class   See Also |

The property labeled "Tint Color" from the "Ceramic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CommonTintColor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CommonTintColor As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CommonTintColor { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDoubleArray4d".

# See Also

Ceramic Class

Autodesk.Revit.DB.Visual Namespace

#### LbForceDashFtPerFt Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol lb-ft/ft, indicating unit Pound force feet per foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LbForceDashFtPerFt { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LbForceDashFtPerFt As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LbForceDashFtPerFt { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### Status Property

---

|  |
| --- |
| RevitAPIPostEventArgs Class   See Also |

Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public RevitAPIEventStatus Status { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Status As RevitAPIEventStatus 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property RevitAPIEventStatus Status { 	RevitAPIEventStatus get (); } ``` |

# See Also

RevitAPIPostEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### SetUnderlineStatus Method (Boolean)

---

|  |
| --- |
| FormattedText Class   See Also |

Sets the characters in the entire text to be underlined or not underlined.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetUnderlineStatus( 	bool isUnderlined ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetUnderlineStatus ( _ 	isUnderlined As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetUnderlineStatus( 	bool isUnderlined ) ``` |

#### Parameters

isUnderlined
:   Type:  System Boolean
     The desired underline status of characters in the entire text. True to set underlined, false to set not underlined.

# See Also

FormattedText Class

SetUnderlineStatus Overload

Autodesk.Revit.DB Namespace

#### Contains Method

---

|  |
| --- |
| MacroManager Class   See Also |

Indicates the given module is a member of this collection.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool Contains( 	MacroModule module ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Contains ( _ 	module As MacroModule _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Contains( 	MacroModule^ module ) ``` |

#### Parameters

module
:   Type:  Autodesk.Revit.DB.Macros MacroModule
     The module.

#### Return Value

Returns true if the given module is a member of this collection, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MacroManager Class

Autodesk.Revit.DB.Macros Namespace

#### PartMakerSplitterProfileFlipAlong Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Profile Along Flip"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PartMakerSplitterProfileFlipAlong { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PartMakerSplitterProfileFlipAlong As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PartMakerSplitterProfileFlipAlong { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetMassDataElementIdForZoneFaceReference Method

---

|  |
| --- |
| MassZone Class   See Also |

MassZone faces come from faces of MassEnergyAnalyticalModel, and those faces have MassSurfaceData or MassLevelData elements associated with them.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId GetMassDataElementIdForZoneFaceReference( 	Reference referenceOfZone ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetMassDataElementIdForZoneFaceReference ( _ 	referenceOfZone As Reference _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetMassDataElementIdForZoneFaceReference( 	Reference^ referenceOfZone ) ``` |

#### Parameters

referenceOfZone
:   Type:  Autodesk.Revit.DB Reference
     Reference to face of the MassZone to get data element for.

#### Return Value

Id of MassSurfaceData or MassLevelData element.

# Remarks

This element will contain the properties associated with the MassEnergyAnalyticalModel face or MassLevelData that the MassZone Face is derived from.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input Reference is not a face Reference of this MassZone. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MassZone Class

Autodesk.Revit.DB.Analysis Namespace

#### CreateRotation Method

---

|  |
| --- |
| Transform Class   See Also |

Creates a transform that represents a rotation about the given axis at (0, 0, 0).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static Transform CreateRotation( 	XYZ axis, 	double angle ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateRotation ( _ 	axis As XYZ, _ 	angle As Double _ ) As Transform ``` |

| Visual C++ |
| --- |
| ``` public: static Transform^ CreateRotation( 	XYZ^ axis,  	double angle ) ``` |

#### Parameters

axis
:   Type:  Autodesk.Revit.DB XYZ
     The rotation axis.

angle
:   Type:  System Double
     The angle.

#### Return Value

The new transform.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value for angle is not finite |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | axis has zero length. |

# See Also

Transform Class

Autodesk.Revit.DB Namespace

#### CannotPasteInViewError Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotPasteInViewError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotPasteInViewError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotPasteInViewError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### Transform Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Transforms this curve loop and all of its component curves by the supplied transformation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void Transform( 	Transform transform ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Transform ( _ 	transform As Transform _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Transform( 	Transform^ transform ) ``` |

#### Parameters

transform
:   Type:  Autodesk.Revit.DB Transform
     The transformation.

# Remarks

The modified CurveLoop is guaranteed to be valid with all consituent curves contiguous (assuming that the curves were contiguous in the input curve loop).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | transform is not conformal. -or- transform has a scale that is negative or zero. |

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### SecondaryHandrailLateralOffset Property

---

|  |
| --- |
| RailingType Class   See Also |

The lateral offset of the secondary handrail.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double SecondaryHandrailLateralOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SecondaryHandrailLateralOffset As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double SecondaryHandrailLateralOffset { 	double get (); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The rail has no secondary hand rail. |

# See Also

RailingType Class

Autodesk.Revit.DB.Architecture Namespace

#### RailingSystemTopRailTypesParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RailingSystemTopRailTypesParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailingSystemTopRailTypesParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RailingSystemTopRailTypesParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsUpdaterRegistered Method (UpdaterId, Document)

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

Checks whether updater with the given id is registered in a document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool IsUpdaterRegistered( 	UpdaterId id, 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsUpdaterRegistered ( _ 	id As UpdaterId, _ 	document As Document _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsUpdaterRegistered( 	UpdaterId^ id,  	Document^ document ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.DB UpdaterId
     Id of the updater being tested.

document
:   Type:  Autodesk.Revit.DB Document
     Document in which this updater is tested whether it's registered or not.

#### Return Value

Returns True if the updater is registered in the given document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

UpdaterRegistry Class

IsUpdaterRegistered Overload

Autodesk.Revit.DB Namespace

#### Description Property

---

|  |
| --- |
| AnalysisResultSchema Class   See Also |

Description of analysis result in view

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public string Description { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Description As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Description { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace

#### SlabShapeVertices Property

---

|  |
| --- |
| SlabShapeEditor Class   See Also |

All of the vertices that can be edited.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SlabShapeVertexArray SlabShapeVertices { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SlabShapeVertices As SlabShapeVertexArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property SlabShapeVertexArray^ SlabShapeVertices { 	SlabShapeVertexArray^ get (); } ``` |

# See Also

SlabShapeEditor Class

Autodesk.Revit.DB Namespace

#### Density Property

---

|  |
| --- |
| ThermalAsset Class   See Also |

The density of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Density { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Density As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Density { 	double get (); 	void set (double value); } ``` |

# Remarks

Values are in kilograms per cubed feet (kg/ftÂ³) and must be non-negative.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for density must be non-negative. |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace

#### ZoneUseOutsideAirPerPersonParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Use Outside Air Per Person"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ZoneUseOutsideAirPerPersonParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ZoneUseOutsideAirPerPersonParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ZoneUseOutsideAirPerPersonParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LineAndTextAttrSymbol Class

---

|  |
| --- |
| Members   See Also |

An object that represents a dimension style.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class LineAndTextAttrSymbol : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class LineAndTextAttrSymbol _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class LineAndTextAttrSymbol : public ElementType ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB LineAndTextAttrSymbol
  Autodesk.Revit.DB FilledRegionType
  Autodesk.Revit.DB GridType
  Autodesk.Revit.DB LevelType
  Autodesk.Revit.DB TextElementType

# See Also

LineAndTextAttrSymbol Members

Autodesk.Revit.DB Namespace

#### BeforeExecuted Event

---

|  |
| --- |
| AddInCommandBinding Class   See Also |

Occurs before the command associated with this AddInCommandBinding executes.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public event EventHandler<BeforeExecutedEventArgs> BeforeExecuted ``` |

| Visual Basic |
| --- |
| ``` Public Event BeforeExecuted As EventHandler(Of BeforeExecutedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<BeforeExecutedEventArgs^>^ BeforeExecuted { 	void add (EventHandler<BeforeExecutedEventArgs^>^ value); 	void remove (EventHandler<BeforeExecutedEventArgs^>^ value); } ``` |

# See Also

AddInCommandBinding Class

Autodesk.Revit.UI Namespace

#### NewFlexPipe Method (Connector, IList(XYZ), FlexPipeType)

---

|  |
| --- |
| Document Class   See Also |

Adds a new flexible pipe into the document, using a connector, point array and pipe type.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FlexPipe NewFlexPipe( 	Connector connector, 	IList<XYZ> points, 	FlexPipeType pipeType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewFlexPipe ( _ 	connector As Connector, _ 	points As IList(Of XYZ), _ 	pipeType As FlexPipeType _ ) As FlexPipe ``` |

| Visual C++ |
| --- |
| ``` public: FlexPipe^ NewFlexPipe( 	Connector^ connector,  	IList<XYZ^>^ points,  	FlexPipeType^ pipeType ) ``` |

#### Parameters

connector
:   Type:  Autodesk.Revit.DB Connector
     The connector to be connected to the flexible pipe, including the end points.

points
:   Type:  System.Collections.Generic IList   XYZ
     The point array indicating the path of the flexible pipe.

pipeType
:   Type:  Autodesk.Revit.DB.Plumbing FlexPipeType
     The type of the flexible pipe.

#### Return Value

If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.

# Remarks

If the connector is a fitting or equipment connector of the correct domain, and if the connector's direction matches the direction of the flexible pipe to be created, the connectors will be automatically connected. A transition fitting will be added at the connector(s) if necessary. If the connector's type, domain, does not match the one of the input connector, no connection will be established.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument connector or points is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the flexible pipe cannot be created or regenerate fails. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the flexible pipe type does not exist in the given document. |

# See Also

Document Class

NewFlexPipe Overload

Autodesk.Revit.Creation Namespace

#### ContinuousFootingBottomHeel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Heel Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ContinuousFootingBottomHeel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ContinuousFootingBottomHeel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ContinuousFootingBottomHeel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ResolveFailures Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

Resolves one or more failures using last set failure resolution type for each of the failures. If failure resolution type was not set for some of failures, default failure resolution type will be used.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void ResolveFailures( 	IList<FailureMessageAccessor> failures ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ResolveFailures ( _ 	failures As IList(Of FailureMessageAccessor) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ResolveFailures( 	IList<FailureMessageAccessor^>^ failures ) ``` |

#### Parameters

failures
:   Type:  System.Collections.Generic IList   FailureMessageAccessor
     The accessors to the failures to be resolved.

# Remarks

After execution of the failure resolutions the failures will not be removed from the document automatically. To prevent failure from being delivered to the user, failures (pre)processor should return ProceedWithCommit. It will cause failures to be regenerated and failure resolution process to be restarted. If attempt to resolve failure was not successful, and the same failure is present on repetitive calls of the failures (pre)processor, the preprocessor code should take care to attempt a different resolution the next time the failure appears, to avoid an infinite loop.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Default resolution of one of the failures is not permitted or not applicable. -or- One of the failures was already attempted to resolve twice with that resolution type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). -or- Resolution of failures is not permitted in the current state of the document. |

# See Also

FailuresAccessor Class

Autodesk.Revit.DB Namespace

#### AdditionalElementsRequired Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Grouping the selected elements requires that additional element(s) also be grouped. [Description] To satisfy the grouping requirement, these additional element(s) will be automatically added to the group as well.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AdditionalElementsRequired { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AdditionalElementsRequired As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AdditionalElementsRequired { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### Export2DIncludingAnnotationObjects Property

---

|  |
| --- |
| CustomExporter Class   See Also |

This flag sets the exporter of 2D views to either include or exclude output of annotation objects when the model is being processed by the export context.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public bool Export2DIncludingAnnotationObjects { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Export2DIncludingAnnotationObjects As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Export2DIncludingAnnotationObjects { 	bool get (); 	void set (bool value); } ``` |

# Remarks

A convenient way of determining whether an element category is annotation is using  [!:Autodesk::Revit::DB::Category::CategoryType]  .

# See Also

CustomExporter Class

Autodesk.Revit.DB Namespace

#### GetFailureMessages Method (FailureSeverity)

---

|  |
| --- |
| FailuresAccessor Class   See Also |

Provides access to the individual failure messages if a given severity currently posted in the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public IList<FailureMessageAccessor> GetFailureMessages( 	FailureSeverity severity ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFailureMessages ( _ 	severity As FailureSeverity _ ) As IList(Of FailureMessageAccessor) ``` |

| Visual C++ |
| --- |
| ``` public: IList<FailureMessageAccessor^>^ GetFailureMessages( 	FailureSeverity severity ) ``` |

#### Parameters

severity
:   Type:  Autodesk.Revit.DB FailureSeverity
     The failure severity for which failure messages are requested. If the requested severity is None, an empty collection is returned.

#### Return Value

Accessors to the individual failure messages of a given severity posted in the document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also

FailuresAccessor Class

GetFailureMessages Overload

Autodesk.Revit.DB Namespace

#### GetExternalResourceReferenceExpanded Method

---

|  |
| --- |
| Element Class   See Also |

Gets the collection of ExternalResourceReference associated with a specified external resource type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public IList<ExternalResourceReference> GetExternalResourceReferenceExpanded( 	ExternalResourceType resourceType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetExternalResourceReferenceExpanded ( _ 	resourceType As ExternalResourceType _ ) As IList(Of ExternalResourceReference) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ExternalResourceReference^>^ GetExternalResourceReferenceExpanded( 	ExternalResourceType^ resourceType ) ``` |

#### Parameters

resourceType
:   Type:  Autodesk.Revit.DB ExternalResourceType
     The desired external resource type.

#### Return Value

The collection of the ExternalResourceReference associated with a specified external resource type.

# Remarks

Use this API for an element which has multiple external resource references under a specified type, e.g., AppearanceAssetElement. See also:  [!:Autodesk::Revit::DB::Element::getExternalResourceReference]  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This Element does not use a resource reference for the specified resource type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### SharedCoords Property

---

|  |
| --- |
| ACADExportOptions Class   See Also |

True to use the shared coordinate system's origin, false to use the project origin. Default value is false.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool SharedCoords { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SharedCoords As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool SharedCoords { 	bool get (); 	void set (bool value); } ``` |

# See Also

ACADExportOptions Class

Autodesk.Revit.DB Namespace

#### DormerCutProblem Property

---

|  |
| --- |
| BuiltInFailures CutFailures Class   See Also |

Dormer Opening Cut is not fully defined. Cut was not performed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DormerCutProblem { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DormerCutProblem As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DormerCutProblem { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CutFailures Class

Autodesk.Revit.DB Namespace

#### CorrectionFactorSet Constructor

---

|  |
| --- |
| CorrectionFactorSet Class   See Also |

Initializes a new instance of the  CorrectionFactorSet  class

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CorrectionFactorSet() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: CorrectionFactorSet() ``` |

# See Also

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace

#### CurrentUserAddinsLocation Property

---

|  |
| --- |
| Application Class   See Also |

The folder location for .addin files for the current user.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string CurrentUserAddinsLocation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CurrentUserAddinsLocation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ CurrentUserAddinsLocation { 	String^ get (); } ``` |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### IsValidObject Property

---

|  |
| --- |
| WorksetTable Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

WorksetTable Class

Autodesk.Revit.DB Namespace

#### FractionalInches Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Fractional inches.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FractionalInches { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FractionalInches As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FractionalInches { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### SetLineWeight Method

---

|  |
| --- |
| Category Class   See Also |

Sets the line weight for the given graphics style type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetLineWeight( 	int lineWeight, 	GraphicsStyleType graphicsStyleType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLineWeight ( _ 	lineWeight As Integer, _ 	graphicsStyleType As GraphicsStyleType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLineWeight( 	int lineWeight,  	GraphicsStyleType graphicsStyleType ) ``` |

#### Parameters

lineWeight
:   Type:  System Int32

graphicsStyleType
:   Type:  Autodesk.Revit.DB GraphicsStyleType
     The type of graphics style.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument-"lineWeight" or "graphicsStyleType"-is out of range. |

# See Also

Category Class

Autodesk.Revit.DB Namespace

#### ConnectionInputPointInfo Class

---

|  |
| --- |
| Members   See Also |

An object that holds description information about a connection input point

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public class ConnectionInputPointInfo : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ConnectionInputPointInfo _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ConnectionInputPointInfo : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure ConnectionInputPointInfo

# See Also

ConnectionInputPointInfo Members

Autodesk.Revit.DB.Structure Namespace

#### Inequality Operator

---

|  |
| --- |
| ScheduleFieldId Class   See Also |

Determines whether two ScheduleFieldId are different.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool operator !=( 	ScheduleFieldId first, 	ScheduleFieldId second ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Operator <> ( _ 	first As ScheduleFieldId, _ 	second As ScheduleFieldId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool operator !=( 	ScheduleFieldId^ first,  	ScheduleFieldId^ second ) ``` |

#### Parameters

first
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The first ScheduleFieldId.

second
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The second ScheduleFieldId.

#### Return Value

True if the ScheduleFieldId are different, otherwise false.

# See Also

ScheduleFieldId Class

Autodesk.Revit.DB Namespace

#### IsRouteAnalysisEnabled Property

---

|  |
| --- |
| Application Class   See Also |

Checks whether or not route analysis is enabled, and enable or disable it.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public bool IsRouteAnalysisEnabled { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsRouteAnalysisEnabled As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsRouteAnalysisEnabled { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### RbsPipeSizeFormattedParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Size"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeSizeFormattedParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeSizeFormattedParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeSizeFormattedParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetCheckoutStatus Method (Document, ElementId)

---

|  |
| --- |
| WorksharingUtils Class   See Also |

Gets the ownership status of an element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static CheckoutStatus GetCheckoutStatus( 	Document document, 	ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetCheckoutStatus ( _ 	document As Document, _ 	elementId As ElementId _ ) As CheckoutStatus ``` |

| Visual C++ |
| --- |
| ``` public: static CheckoutStatus GetCheckoutStatus( 	Document^ document,  	ElementId^ elementId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document containing the element.

elementId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the element.

#### Return Value

A summary of whether the element is unowned, owned by the current user, or owned by another user.

# Remarks

This method returns a locally cached value which may not be up to date with the current state of the element in the central. Because of this, the return value is suitable for reporting to an interactive user (e.g. via a mechanism similar to Worksharing display mode), but cannot be considered a reliable indication of whether the element can be immediately edited by the application. Also, the return value may not be dependable in the middle of a local transaction. See the remarks on  WorksharingUtils  for more details.

For performance reasons, the model is not validated to be workshared, and the element id is also not validated; the element will not be expanded.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

WorksharingUtils Class

GetCheckoutStatus Overload

Autodesk.Revit.DB Namespace

#### SlantedColumnTopExtension Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Extension"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SlantedColumnTopExtension { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SlantedColumnTopExtension As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SlantedColumnTopExtension { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ClosedShell Property

---

|  |
| --- |
| Room Class   See Also |

Return the closedShell of the Room.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public GeometryElement ClosedShell { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ClosedShell As GeometryElement 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property GeometryElement^ ClosedShell { 	GeometryElement^ get (); } ``` |

# See Also

Room Class

Autodesk.Revit.DB.Architecture Namespace

#### PoundsMassPerCubicFoot Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Pounds mass per cubic foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PoundsMassPerCubicFoot { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PoundsMassPerCubicFoot As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PoundsMassPerCubicFoot { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### AnalyticalLinkReleaseRotationX Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"X Rotation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalLinkReleaseRotationX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalLinkReleaseRotationX As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalLinkReleaseRotationX { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetEntries Method

---

|  |
| --- |
| KeyBasedTreeEntriesLoadContent Class   See Also |

Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public KeyBasedTreeEntries GetEntries() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetEntries As KeyBasedTreeEntries ``` |

| Visual C++ |
| --- |
| ``` public: KeyBasedTreeEntries^ GetEntries() ``` |

#### Return Value

A copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is not built yet. The information about this KeyBasedTreeEntries object is not available. |

# See Also

KeyBasedTreeEntriesLoadContent Class

Autodesk.Revit.DB Namespace

#### ShowGraphicalWarningElectricalDisconnects Property

---

|  |
| --- |
| Application Class   See Also |

Whether or not to show the graphical warnings for Electrical disconnects.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool ShowGraphicalWarningElectricalDisconnects { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowGraphicalWarningElectricalDisconnects As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowGraphicalWarningElectricalDisconnects { 	bool get (); 	void set (bool value); } ``` |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### RotateConnectedTap Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016 Subscription Release

# Syntax

| C# |
| --- |
| ``` public static void RotateConnectedTap( 	Document doc, 	FabricationPart tap, 	double primaryAxisRotateBy, 	double secondaryAxisRotateBy ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub RotateConnectedTap ( _ 	doc As Document, _ 	tap As FabricationPart, _ 	primaryAxisRotateBy As Double, _ 	secondaryAxisRotateBy As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void RotateConnectedTap( 	Document^ doc,  	FabricationPart^ tap,  	double primaryAxisRotateBy,  	double secondaryAxisRotateBy ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document.

tap
:   Type:  Autodesk.Revit.DB FabricationPart
     The connected fabrication part tap to rotate.

primaryAxisRotateBy
:   Type:  System Double
     The primary axis rotation angle in radians to rotate by.

secondaryAxisRotateBy
:   Type:  System Double
     The secondary axis rotation angle in radians to rotate by.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Is not connected as a fabrication part tap. -or- tap cannot be rotated about the primary axis by the specified angle: primaryAxisRotateBy -or- tap cannot be rotated about the secondary axis by the specified angle: secondaryAxisRotateBy |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### MaterialBelongTo Property

---

|  |
| --- |
| GroundConductorSize Class   See Also |

Get the material type which include this ground conductor size information.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public WireMaterialType MaterialBelongTo { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MaterialBelongTo As WireMaterialType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property WireMaterialType^ MaterialBelongTo { 	WireMaterialType^ get (); } ``` |

# See Also

GroundConductorSize Class

Autodesk.Revit.DB.Electrical Namespace

#### GeomStepFailed Property

---

|  |
| --- |
| BuiltInFailures RegenFailures Class   See Also |

Can't rebuild geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId GeomStepFailed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GeomStepFailed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ GeomStepFailed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RegenFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| TessellatedFace Class   See Also |

Releases all resources used by the  TessellatedFace

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

TessellatedFace Class

Autodesk.Revit.DB Namespace

#### PatternId Property

---

|  |
| --- |
| LineProperties Class   See Also |

Id of the current Line pattern element used when drawing lines/curves.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public ElementId PatternId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property PatternId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ PatternId { 	ElementId^ get (); } ``` |

# See Also

LineProperties Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamExpCoeffn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Thermal Expansion Coefficient 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamExpCoeffn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamExpCoeffn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamExpCoeffn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DesignHVACLoadperArea Property

---

|  |
| --- |
| Space Class   See Also |

Get or set the Design HVAC Load per Area of the Space.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double DesignHVACLoadperArea { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DesignHVACLoadperArea As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double DesignHVACLoadperArea { 	double get (); 	void set (double value); } ``` |

# Remarks

This property is used to get or set the Design HVAC Load per Area (Unit: W/ft2) of the Space.

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace

#### GetRemovedUsers Method

---

|  |
| --- |
| WorksharingDisplaySettings Class   See Also |

Returns the set of users who have been explicitly removed from the settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ICollection<string> GetRemovedUsers() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRemovedUsers As ICollection(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<String^>^ GetRemovedUsers() ``` |

#### Return Value

Users who have been explicitly removed from the list.

# See Also

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace

#### CannotCopyNoAttachedParentWarn Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Attached Detail Group can't be copied without its Model Group

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyNoAttachedParentWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyNoAttachedParentWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyNoAttachedParentWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### MultiReferenceAnnotationDimensionStyle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Dimension Style"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MultiReferenceAnnotationDimensionStyle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MultiReferenceAnnotationDimensionStyle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MultiReferenceAnnotationDimensionStyle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| IndexStream Class   See Also |

Releases all resources used by the  IndexStream

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

IndexStream Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### ListNames Method

---

|  |
| --- |
| ExportDGNSettings Class   See Also |

Returns a list of names of dgn export settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static IList<string> ListNames( 	Document aDoc ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ListNames ( _ 	aDoc As Document _ ) As IList(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<String^>^ ListNames( 	Document^ aDoc ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     A Revit document to retrieve names from

#### Return Value

An array of strings representing names of predefined setups.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportDGNSettings Class

Autodesk.Revit.DB Namespace

#### OpaqueF0 Property

---

|  |
| --- |
| AdvancedOpaque Class   See Also |

The property labeled "Specular reflectance" from the "AdvancedOpaque" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string OpaqueF0 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OpaqueF0 As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ OpaqueF0 { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble". This property allows a connected asset.

# See Also

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace

#### AddOverride Method (ElementId, Int32)

---

|  |
| --- |
| RebarContainerParameterManager Class   See Also |

Adds an override for the given parameter as its value will be displayed for the Rebar Container element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void AddOverride( 	ElementId paramId, 	int value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddOverride ( _ 	paramId As ElementId, _ 	value As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddOverride( 	ElementId^ paramId,  	int value ) ``` |

#### Parameters

paramId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the parameter

value
:   Type:  System Int32
     The override value of the parameter.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | paramId is not the id of a parameter in the current document, or its value type is not integer. -or- paramId is not a Rebar Container parameter |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarContainerParameterManager Class

AddOverride Overload

Autodesk.Revit.DB.Structure Namespace

#### GetDistance Method

---

|  |
| --- |
| Alignment Class   See Also |

Calculates the relative distance along the alignment between two stations based on their alignment distances according to Revit Internal Origin Coordinate Base. The distance may be positive or negative depending on the relative positions of the input stations on the alignment.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public double GetDistance( 	double fromStation, 	double toStation ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDistance ( _ 	fromStation As Double, _ 	toStation As Double _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetDistance( 	double fromStation,  	double toStation ) ``` |

#### Parameters

fromStation
:   Type:  System Double
     The displayed alignment station from which 2D length is to be calculated, in Revit internal model units (standard Imperial feet).

toStation
:   Type:  System Double
     The displayed alignment station to which 2D length is to be calculated, in Revit internal model units (standard Imperial feet).

#### Return Value

Distance (positive or negative) along the alignment between two stations. The sign of the distance depends on the relative positions of the input stations on the alignment.

# See Also

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace

#### GetAllHandles Method

---

|  |
| --- |
| RebarConstraintsManager Class   See Also |

Gets all RebarConstrainedHandles of this bar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public IList<RebarConstrainedHandle> GetAllHandles() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAllHandles As IList(Of RebarConstrainedHandle) ``` |

| Visual C++ |
| --- |
| ``` public: IList<RebarConstrainedHandle^>^ GetAllHandles() ``` |

#### Return Value

All RebarConstrainedHandle objects will be returned, regardless of whether there are constraints associated to them.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The RebarConstraintsManager does not manage a valid Rebar element. |

# See Also

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace

#### SuccessToConvertLine Property

---

|  |
| --- |
| BuiltInFailures GeometryFailures Class   See Also |

Success to convert lines

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SuccessToConvertLine { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SuccessToConvertLine As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SuccessToConvertLine { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeometryFailures Class

Autodesk.Revit.DB Namespace

#### Count Property

---

|  |
| --- |
| ExportPatternTable Class   See Also |

Count of the items contained in the collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int Count { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Count As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int Count { 	int get (); } ``` |

# See Also

ExportPatternTable Class

Autodesk.Revit.DB Namespace

#### IsUnobscuredInView Method

---

|  |
| --- |
| RebarContainer Class   See Also |

Checks if this rebar container element is shown unobscured in a view.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool IsUnobscuredInView( 	View view ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsUnobscuredInView ( _ 	view As View _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsUnobscuredInView( 	View^ view ) ``` |

#### Parameters

view
:   Type:  Autodesk.Revit.DB View
     The view element

#### Return Value

True if rebar is shown unobscured, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InapplicableDataException | This rebar container element doesn't have valid visibility data. |

# See Also

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace

#### CanUseHookType Method

---

|  |
| --- |
| RebarContainerItem Class   See Also |

Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool CanUseHookType( 	ElementId proposedHookId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanUseHookType ( _ 	proposedHookId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanUseHookType( 	ElementId^ proposedHookId ) ``` |

#### Parameters

proposedHookId
:   Type:  Autodesk.Revit.DB ElementId
     The Id of the RebarHookType

#### Return Value

Returns true if the id is of a valid RebarHookType for the Rebar element.

# Remarks

Also, checks that the Style of the Hook matches that of the Rebar's RebarShape

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### RuledFace Class

---

|  |
| --- |
| Members   Example   See Also |

A ruled face of a 3d solid or open shell.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public class RuledFace : Face ``` |

| Visual Basic |
| --- |
| ``` Public Class RuledFace _ 	Inherits Face ``` |

| Visual C++ |
| --- |
| ``` public ref class RuledFace : public Face ``` |

# Remarks

A ruled surface is created by sweeping a line between two profile curves or between a curve and a point (a point and a curve). For details on the parameterization, refer to the documentation for  RuledSurface  .

# Examples

 Copy  C#

```
private void GetRuledFaceInfo(Face face)
{
    RuledFace ruledFace = face as RuledFace;
    if (null != ruledFace)
    {
        Curve curve = ruledFace.get_Curve(0);
        XYZ point = ruledFace.get_Point(0);
    }
}
```

 Copy  VB.NET

```
Private Sub GetRuledFaceInfo(face As Face)
    Dim ruledFace As RuledFace = TryCast(face, RuledFace)
    If ruledFace IsNot Nothing Then
        Dim curve As Curve = ruledFace.Curve(0)
        Dim point As XYZ = ruledFace.Point(0)
    End If
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB GeometryObject
  Autodesk.Revit.DB Face
  Autodesk.Revit.DB RuledFace

# See Also

RuledFace Members

Autodesk.Revit.DB Namespace

#### ACAPreference Property

---

|  |
| --- |
| ACADExportOptions Class   See Also |

The preferred way to generate geometry of ACA objects. Default value is ACAObjectPreference.Object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ACAObjectPreference ACAPreference { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ACAPreference As ACAObjectPreference 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ACAObjectPreference ACAPreference { 	ACAObjectPreference get (); 	void set (ACAObjectPreference value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ACADExportOptions Class

Autodesk.Revit.DB Namespace

#### Profile1FlippedHor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Profile Is Flipped"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Profile1FlippedHor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Profile1FlippedHor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Profile1FlippedHor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CmSup2PerM Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol cmÂ²/m, indicating unit Square centimeters per meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CmSup2PerM { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CmSup2PerM As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CmSup2PerM { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### UseHatchBackgroundColor Property

---

|  |
| --- |
| ACADExportOptions Class   See Also |

Indicates if hatch background color will be used or not. default value is false.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool UseHatchBackgroundColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UseHatchBackgroundColor As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool UseHatchBackgroundColor { 	bool get (); 	void set (bool value); } ``` |

# See Also

ACADExportOptions Class

Autodesk.Revit.DB Namespace

#### ProjectionLinePatternId Property

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

Id of the projection surface line pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ElementId ProjectionLinePatternId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ProjectionLinePatternId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ProjectionLinePatternId { 	ElementId^ get (); } ``` |

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### SpacingLengthVert Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Spacing"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacingLengthVert { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacingLengthVert As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacingLengthVert { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Create Method (Document)

---

|  |
| --- |
| EndTreatmentType Class   See Also |

Creates a new EndTreatmentType in a document.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static EndTreatmentType Create( 	Document doc ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	doc As Document _ ) As EndTreatmentType ``` |

| Visual C++ |
| --- |
| ``` public: static EndTreatmentType^ Create( 	Document^ doc ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

EndTreatmentType Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### DockableFrameFocusChangedEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the DockableFrameActivatedChanged event.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class DockableFrameFocusChangedEventArgs : RevitAPISingleEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class DockableFrameFocusChangedEventArgs _ 	Inherits RevitAPISingleEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class DockableFrameFocusChangedEventArgs : public RevitAPISingleEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPISingleEventArgs
  Autodesk.Revit.UI.Events DockableFrameFocusChangedEventArgs

# See Also

DockableFrameFocusChangedEventArgs Members

Autodesk.Revit.UI.Events Namespace

#### TextureRealWorldOffsetX Property

---

|  |
| --- |
| Noise Class   See Also |

The property labeled "Offset X" from the "Noise" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldOffsetX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldOffsetX As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldOffsetX { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance".

# See Also

Noise Class

Autodesk.Revit.DB.Visual Namespace

#### DegreeR Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Â°R, indicating unit Rankine.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DegreeR { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DegreeR As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DegreeR { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### StoryAboveDeleted Property

---

|  |
| --- |
| BuiltInFailures LevelFailures Class   See Also |

The level set as the Story Above for these levels is being deleted. This change will cause these levels to revert to the default Story Above.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StoryAboveDeleted { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StoryAboveDeleted As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StoryAboveDeleted { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures LevelFailures Class

Autodesk.Revit.DB Namespace

#### SurfaceAreaPerUnitLength Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Surface Area per Unit Length, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SurfaceAreaPerUnitLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceAreaPerUnitLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SurfaceAreaPerUnitLength { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### FamilyCategoryPseudoParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Category"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FamilyCategoryPseudoParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyCategoryPseudoParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FamilyCategoryPseudoParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AllModelTypeComments Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Type Comments"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AllModelTypeComments { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AllModelTypeComments As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AllModelTypeComments { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AnalyticalMemberForceEndAllNonZero Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"All non 0 forces at end"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalMemberForceEndAllNonZero { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalMemberForceEndAllNonZero As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalMemberForceEndAllNonZero { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SweepBaseVertOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Vertical Profile Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SweepBaseVertOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SweepBaseVertOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SweepBaseVertOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DefaultPathOfTravelCalculationGUID Property

---

|  |
| --- |
| PathOfTravelCalculationServerIds Class   See Also |

GUID to represent the default calculation server id.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public static Guid DefaultPathOfTravelCalculationGUID { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DefaultPathOfTravelCalculationGUID As Guid 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property Guid DefaultPathOfTravelCalculationGUID { 	Guid get (); } ``` |

# See Also

PathOfTravelCalculationServerIds Class

Autodesk.Revit.DB.Analysis Namespace

#### CombinableElementArrayIterator Constructor

---

|  |
| --- |
| CombinableElementArrayIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CombinableElementArrayIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: CombinableElementArrayIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

CombinableElementArrayIterator Class

Autodesk.Revit.DB Namespace

#### GetBasicIEnumerator Method

---

|  |
| --- |
| ExportPatternTable Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` internal virtual IEnumerator GetBasicIEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Friend Overridable Function GetBasicIEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` internal: virtual IEnumerator^ GetBasicIEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable GetEnumerator

# See Also

ExportPatternTable Class

Autodesk.Revit.DB Namespace

#### GetOpenUIViews Method

---

|  |
| --- |
| UIDocument Class   See Also |

Get a list of all open view windows in the Revit user interface.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public IList<UIView> GetOpenUIViews() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetOpenUIViews As IList(Of UIView) ``` |

| Visual C++ |
| --- |
| ``` public: IList<UIView^>^ GetOpenUIViews() ``` |

# Remarks

A sheet view with an activated viewport will return the view associated with the activated viewport, not the sheet view.

# See Also

UIDocument Class

Autodesk.Revit.UI Namespace

#### Language Property

---

|  |
| --- |
| ControlledApplication Class   See Also |

The language used in the current session of Revit.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public LanguageType Language { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Language As LanguageType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property LanguageType Language { 	LanguageType get (); } ``` |

# Remarks

Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### LoadAreaForceFz2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Fz 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadAreaForceFz2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadAreaForceFz2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadAreaForceFz2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AddFilter Method

---

|  |
| --- |
| ScheduleDefinition Class   Example   See Also |

Adds a new filter at the end of the list.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void AddFilter( 	ScheduleFilter filter ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddFilter ( _ 	filter As ScheduleFilter _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddFilter( 	ScheduleFilter^ filter ) ``` |

#### Parameters

filter
:   Type:  Autodesk.Revit.DB ScheduleFilter
     The filter to add.

# Examples

 Copy  C#

```
public static void AddFilterToSchedule(ViewSchedule schedule, ElementId levelId)
{
    // Find level field
    ScheduleDefinition definition = schedule.Definition;

    ScheduleField levelField = FindField(schedule, BuiltInParameter.ROOM_LEVEL_ID);

    // Add filter
    using (Transaction t = new Transaction(schedule.Document, "Add filter"))
    {
        t.Start();

        // If field not present, add it
        if (levelField == null)
        {
            levelField = definition.AddField(ScheduleFieldType.Instance, new ElementId(BuiltInParameter.ROOM_LEVEL_ID));
        }

        // Set field to hidden
        levelField.IsHidden = true;
        ScheduleFilter filter = new ScheduleFilter(levelField.FieldId, ScheduleFilterType.Equal, levelId);
        definition.AddFilter(filter);

        t.Commit();
    }
}

/// <summary>
/// Finds an existing ScheduleField matching the given parameter
/// </summary>
/// <param name="schedule"></param>
/// <param name="paramEnum"></param>
/// <returns></returns>
public static ScheduleField FindField(ViewSchedule schedule, BuiltInParameter paramEnum)
{
    ScheduleDefinition definition = schedule.Definition;
    ScheduleField foundField = null;
    ElementId paramId = new ElementId(paramEnum);

    foreach (ScheduleFieldId fieldId in definition.GetFieldOrder())
    {
        foundField = definition.GetField(fieldId);
        if (foundField.ParameterId == paramId)
        {
            return foundField;
        }
    }

    return null;
}
```

 Copy  VB.NET

```
Public Shared Sub AddFilterToSchedule(schedule As ViewSchedule, levelId As ElementId)
    ' Find level field
    Dim definition As ScheduleDefinition = schedule.Definition

    Dim levelField As ScheduleField = FindField(schedule, BuiltInParameter.ROOM_LEVEL_ID)

    ' Add filter
    Using t As New Transaction(schedule.Document, "Add filter")
        t.Start()

        ' If field not present, add it
        If levelField Is Nothing Then
            levelField = definition.AddField(ScheduleFieldType.Instance, New ElementId(BuiltInParameter.ROOM_LEVEL_ID))
        End If

        ' Set field to hidden
        levelField.IsHidden = True
        Dim filter As New ScheduleFilter(levelField.FieldId, ScheduleFilterType.Equal, levelId)
        definition.AddFilter(filter)

        t.Commit()
    End Using
End Sub

' <summary>
' Finds an existing ScheduleField matching the given parameter
' </summary>
' <param name="schedule"></param>
' <param name="paramEnum"></param>
' <returns></returns>
Public Shared Function FindField(schedule As ViewSchedule, paramEnum As BuiltInParameter) As ScheduleField
    Dim definition As ScheduleDefinition = schedule.Definition
    Dim foundField As ScheduleField = Nothing
    Dim paramId As New ElementId(paramEnum)

    For Each fieldId As ScheduleFieldId In definition.GetFieldOrder()
        foundField = definition.GetField(fieldId)
        If foundField.ParameterId = paramId Then
            Return foundField
        End If
    Next

    Return Nothing
End Function
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The field ID is not the ID of a field in this ScheduleDefinition. -or- The field and filter type cannot be used to filter this ScheduleDefinition. -or- The filter value is not valid for the field and filter type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This ScheduleDefinition does not support filters. -or- The resulting filter count would be greater than 8. |

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### MoveNext Method

---

|  |
| --- |
| IntersectionResultArrayIterator Class   See Also |

Move the iterator one item forward.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool MoveNext() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function MoveNext As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool MoveNext() ``` |

#### Return Value

Returns True if the iterator was successfully moved forward one item and the Current property will return a valid item. False will be returned it the iterator has reached the end of the array.

#### Implements

 IEnumerator MoveNext

# Remarks

MoveNext must be called before the Current property is valid with a new or Reset iterator in line with the expected behavior of IEnumerator.

# See Also

IntersectionResultArrayIterator Class

Autodesk.Revit.DB Namespace

#### Item Property

---

|  |
| --- |
| SlabShapeVertexArray Class   See Also |

Gets or sets an item at a specified index within the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual SlabShapeVertex this[ 	int index ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property Item ( _ 	index As Integer _ ) As SlabShapeVertex 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property SlabShapeVertex^ Item[int index] { 	SlabShapeVertex^ get (int index); 	void set (int index, SlabShapeVertex^ value); } ``` |

#### Parameters

index
:   Type:  System Int32
     The index of the item to be set or retrieved.

#### Return Value

Returns the object at the specified index.

# See Also

SlabShapeVertexArray Class

Autodesk.Revit.DB Namespace

#### GraphicDisplayOptionsModel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Model Display"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GraphicDisplayOptionsModel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GraphicDisplayOptionsModel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GraphicDisplayOptionsModel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| WireConduitTypeSet Class   See Also |

Insert the specified conduit type into the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Insert( 	WireConduitType item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Insert ( _ 	item As WireConduitType _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	WireConduitType^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB.Electrical WireConduitType
     The conduit type to be inserted into the set.

#### Return Value

Returns whether the conduit type was inserted into the set.

# See Also

WireConduitTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### FillPatternTarget Enumeration

---

|  |
| --- |
| See Also |

The type of the fill pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum FillPatternTarget ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FillPatternTarget ``` |

| Visual C++ |
| --- |
| ``` public enum class FillPatternTarget ``` |

# Members

| Member name | Description |
| --- | --- |
| Drafting | Represents a material in symbolic form. |
| Model | Represents an actual element appearance on a building. |
| None |  |

# See Also

Autodesk.Revit.DB Namespace

#### CeramicBumpType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "CeramicBump" from the "Ceramic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum CeramicBumpType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CeramicBumpType ``` |

| Visual C++ |
| --- |
| ``` public enum class CeramicBumpType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Wavy |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace

#### EvaluateOnFace Method

---

|  |
| --- |
| Edge Class   See Also |

Evaluates a parameter on the edge to produce UV coordinates on the face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public UV EvaluateOnFace( 	double param, 	Face face ) ``` |

| Visual Basic |
| --- |
| ``` Public Function EvaluateOnFace ( _ 	param As Double, _ 	face As Face _ ) As UV ``` |

| Visual C++ |
| --- |
| ``` public: UV^ EvaluateOnFace( 	double param,  	Face^ face ) ``` |

#### Parameters

param
:   Type:  System Double
     The parameter to be evaluated, in [0,1].

face
:   Type:  Autodesk.Revit.DB Face
     The face on which to perform the evaluation. Must belong to the edge.

# See Also

Edge Class

Autodesk.Revit.DB Namespace

#### HostedSweepType Class

---

|  |
| --- |
| Members   See Also |

An object that represents the attributes for sweep host objects in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class HostedSweepType : HostObjAttributes ``` |

| Visual Basic |
| --- |
| ``` Public Class HostedSweepType _ 	Inherits HostObjAttributes ``` |

| Visual C++ |
| --- |
| ``` public ref class HostedSweepType : public HostObjAttributes ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB HostObjAttributes
  Autodesk.Revit.DB HostedSweepType
  Autodesk.Revit.DB.Architecture FasciaType
  Autodesk.Revit.DB.Architecture GutterType
  Autodesk.Revit.DB SlabEdgeType

# See Also

HostedSweepType Members

Autodesk.Revit.DB Namespace

#### EdgeHostedPointToBeUnhosted Property

---

|  |
| --- |
| BuiltInFailures PointFailures Class   See Also |

A point element in a family was hosted on an edge outside its family and the edge no longer exists. The point will remain placed but with no host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId EdgeHostedPointToBeUnhosted { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EdgeHostedPointToBeUnhosted As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ EdgeHostedPointToBeUnhosted { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PointFailures Class

Autodesk.Revit.DB Namespace

#### ScheduleHeightsOnSheet Class

---

|  |
| --- |
| Members   See Also |

Heights information of a schedule on sheet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public class ScheduleHeightsOnSheet : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ScheduleHeightsOnSheet _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ScheduleHeightsOnSheet : IDisposable ``` |

# Remarks

This class returns the heights of schedule title, column header and each body row on sheet view.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ScheduleHeightsOnSheet

# See Also

ScheduleHeightsOnSheet Members

Autodesk.Revit.DB Namespace

#### LbMassPerLbDegreeF Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol lb/(lbÂ·Â°F), indicating unit Pounds mass per pound degree Fahrenheit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LbMassPerLbDegreeF { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LbMassPerLbDegreeF As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LbMassPerLbDegreeF { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### DimStyleDimLineSnapDist Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Dimension Line Snap Distance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimStyleDimLineSnapDist { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimStyleDimLineSnapDist As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimStyleDimLineSnapDist { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NotBentSharedFamily Property

---

|  |
| --- |
| BuiltInFailures BendFailures Class   See Also |

While making curved beam type "[Type Name]" Shared Family Instances were not created

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotBentSharedFamily { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotBentSharedFamily As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotBentSharedFamily { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures BendFailures Class

Autodesk.Revit.DB Namespace

#### LayoutRuleFixedDistance Constructor

---

|  |
| --- |
| LayoutRuleFixedDistance Class   See Also |

Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public LayoutRuleFixedDistance( 	double spacing, 	BeamSystemJustifyType justifyType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	spacing As Double, _ 	justifyType As BeamSystemJustifyType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: LayoutRuleFixedDistance( 	double spacing,  	BeamSystemJustifyType justifyType ) ``` |

#### Parameters

spacing
:   Type:  System Double
     The value of spacing must be between 0 and 30000.

justifyType
:   Type:  Autodesk.Revit.DB BeamSystemJustifyType
     The type of the justification, it's corresponding to the items in the element properties dialog.

# See Also

LayoutRuleFixedDistance Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| EdgeArrayArray Class   See Also |

Removes every edge array from the array, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

EdgeArrayArray Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| ElementSet Class   See Also |

Insert the specified element into the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Insert( 	Element item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Insert ( _ 	item As Element _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	Element^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB Element
     The element to be inserted into the set.

#### Return Value

Returns whether the element was inserted into the set.

# See Also

ElementSet Class

Autodesk.Revit.DB Namespace

#### ViewOrganizationId Property

---

|  |
| --- |
| InSessionViewSheetSet Class   See Also |

ElementId  to the  BrowserOrganization  for non-sheet views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual ElementId ViewOrganizationId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property ViewOrganizationId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property ElementId^ ViewOrganizationId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

#### Implements

 IViewSheetSet ViewOrganizationId

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the  ElementId  does not reference to  BrowserOrganization  , or the target type of  BrowserOrganization  is incompatible. |

# See Also

InSessionViewSheetSet Class

Autodesk.Revit.DB Namespace

#### StairsRunBottomElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Relative Base Height": Relative height to stairs bottom elevation

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRunBottomElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRunBottomElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRunBottomElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetKnotsV Method

---

|  |
| --- |
| NurbsSurfaceData Class   See Also |

Get the list of knots in the v-direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public IList<double> GetKnotsV() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetKnotsV As IList(Of Double) ``` |

| Visual C++ |
| --- |
| ``` public: IList<double>^ GetKnotsV() ``` |

# See Also

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace

#### RebarShapeParamStartHookTanLen Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Start Tangent Hook Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarShapeParamStartHookTanLen { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarShapeParamStartHookTanLen As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarShapeParamStartHookTanLen { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PreheatCoilType Property

---

|  |
| --- |
| AirSystemData Class   See Also |

The preheat coil type. Note this property change would reset the preheat water loop.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public AirHeatingCoilType PreheatCoilType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PreheatCoilType As AirHeatingCoilType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property AirHeatingCoilType PreheatCoilType { 	AirHeatingCoilType get (); 	void set (AirHeatingCoilType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

AirSystemData Class

Autodesk.Revit.DB.Mechanical Namespace

#### ForwardIterator Method

---

|  |
| --- |
| CombinableElementArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual CombinableElementArrayIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As CombinableElementArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual CombinableElementArrayIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

# See Also

CombinableElementArray Class

Autodesk.Revit.DB Namespace

#### Import Method (String, DWGImportOptions, View, ElementId)

---

|  |
| --- |
| Document Class   See Also |

Imports a DWG or DXF file to the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public bool Import( 	string file, 	DWGImportOptions options, 	View pDBView, 	out ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Import ( _ 	file As String, _ 	options As DWGImportOptions, _ 	pDBView As View, _ 	<OutAttribute> ByRef elementId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Import( 	String^ file,  	DWGImportOptions^ options,  	View^ pDBView,  	[OutAttribute] ElementId^% elementId ) ``` |

#### Parameters

file
:   Type:  System String
     Full path of the file to import. File must exist and must be a valid DWG or DXF file.

options
:   Type:  Autodesk.Revit.DB DWGImportOptions
     Various options applicable to the DWG or DXF format. If    a null reference (  Nothing  in Visual Basic)  , all options will be set to their respective default values.

pDBView
:   Type:  Autodesk.Revit.DB View
     View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported file. If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.

elementId
:   Type:  Autodesk.Revit.DB ElementId   %
     The id of imported instance after a successful import.

#### Return Value

True if successful, otherwise False.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Not a valid file for DWG import (.dwg and .dxf files are valid). -or- ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view. -or- The provided view is not valid for the options provided. -or- One or more strings describing layer selection is invalid or empty. -or- The line weights are not valid; either it contains an invalid number of line weights, or a line weight outside the valid range. -or- The scale is not valid as a CustomScale for use during import. -or- NullOrEmpty -or- The view is not printable. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | The given file does not exist. |
| Autodesk.Revit.Exceptions InvalidOperationException | Import is temporarily disabled. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |
| Autodesk.Revit.Exceptions OptionalFunctionalityNotAvailableException | The DWG Import/Link module is not available in the installed Revit. |

# See Also

Document Class

Import Overload

Autodesk.Revit.DB Namespace

#### LoadAttrAreaForceScaleFactor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Area force scale"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadAttrAreaForceScaleFactor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadAttrAreaForceScaleFactor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadAttrAreaForceScaleFactor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetInterpolatingCurves Method

---

|  |
| --- |
| ReferencePoint Class   See Also |

The set of CurveByPoints elements that interpolate a ReferencePoint.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurveByPointsArray GetInterpolatingCurves() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetInterpolatingCurves As CurveByPointsArray ``` |

| Visual C++ |
| --- |
| ``` public: CurveByPointsArray^ GetInterpolatingCurves() ``` |

# Remarks

A CurveByPoints is in the  GetInterpolatingCurves  array if and only if the ReferencePoint is in the Points array of  CurveByPoints  .

# See Also

ReferencePoint Class

Autodesk.Revit.DB Namespace

#### IsWorksetVisible Method

---

|  |
| --- |
| WorksetDefaultVisibilitySettings Class   See Also |

Indicates whether the workset is visible by default.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool IsWorksetVisible( 	WorksetId worksetId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsWorksetVisible ( _ 	worksetId As WorksetId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsWorksetVisible( 	WorksetId^ worksetId ) ``` |

#### Parameters

worksetId
:   Type:  Autodesk.Revit.DB WorksetId
     Id of the workset.

#### Return Value

Whether the workset is visible by default.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | There is no workset with this Id in the document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | WorksetDefaultVisibilitySettings is not applicable to family documents. |

# See Also

WorksetDefaultVisibilitySettings Class

Autodesk.Revit.DB Namespace

#### IsTypeNameValidForCustomConnection Method

---

|  |
| --- |
| StructuralConnectionHandlerType Class   See Also |

Validates if the input name matches the criteria of StructuralConnectionHandlerType name. Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\/:\*?";<>| or any of the non-printable characters.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static bool IsTypeNameValidForCustomConnection( 	Document document, 	string typeName ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsTypeNameValidForCustomConnection ( _ 	document As Document, _ 	typeName As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsTypeNameValidForCustomConnection( 	Document^ document,  	String^ typeName ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Document.

typeName
:   Type:  System String
     The StructuralConnectionHandlerType name to validate.

#### Return Value

True if the input name matches the criteria of StructuralConnectionHandlerType name.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace

#### DWFImageQuality Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible image quality for DWF Export.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum DWFImageQuality ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DWFImageQuality ``` |

| Visual C++ |
| --- |
| ``` public enum class DWFImageQuality ``` |

# Members

| Member name | Description |
| --- | --- |
| Default |  |
| Low |  |
| Medium |  |
| High |  |

# See Also

Autodesk.Revit.DB Namespace

#### Kcal Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kcal, indicating unit Kilocalories.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Kcal { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Kcal As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Kcal { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| FamilySizeTableErrorInfo Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

FamilySizeTableErrorInfo Class

Autodesk.Revit.DB Namespace

#### SpaceCarpetingParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Carpeting"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpaceCarpetingParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpaceCarpetingParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpaceCarpetingParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarGeometryType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Geometry"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarGeometryType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarGeometryType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarGeometryType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### OriginalElementTypeId Property

---

|  |
| --- |
| ElementTypeDuplicatedEventArgs Class   See Also |

The id of the element type that is duplicated.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public ElementId OriginalElementTypeId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property OriginalElementTypeId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ OriginalElementTypeId { 	ElementId^ get (); } ``` |

# See Also

ElementTypeDuplicatedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### ImportSymbolName Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Name"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ImportSymbolName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ImportSymbolName As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ImportSymbolName { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HeadingOrientation Property

---

|  |
| --- |
| ScheduleField Class   See Also |

The orientation of the column heading text.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ScheduleHeadingOrientation HeadingOrientation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property HeadingOrientation As ScheduleHeadingOrientation 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ScheduleHeadingOrientation HeadingOrientation { 	ScheduleHeadingOrientation get (); 	void set (ScheduleHeadingOrientation value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ScheduleField Class

Autodesk.Revit.DB Namespace

#### ForwardIterator Method

---

|  |
| --- |
| EdgeArrayArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual EdgeArrayArrayIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As EdgeArrayArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual EdgeArrayArrayIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

# See Also

EdgeArrayArray Class

Autodesk.Revit.DB Namespace

#### PreviewControl Constructor

---

|  |
| --- |
| PreviewControl Class   See Also |

Constructs a preview control.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public PreviewControl( 	Document document, 	ElementId viewId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	document As Document, _ 	viewId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: PreviewControl( 	Document^ document,  	ElementId^ viewId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

viewId
:   Type:  Autodesk.Revit.DB ElementId
     The view id want to browse in this control.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when dbDocument or viewId is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the given document is a linked document or the given viewId is invalid or the view is a schedule or other non-graphical view such as schedule views or the project browser view. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when there is an active preview control already. |

# See Also

PreviewControl Class

Autodesk.Revit.UI Namespace

#### ImportOptions3DM Constructor (ImportOptions3DM)

---

|  |
| --- |
| ImportOptions3DM Class   See Also |

Constructs a new instance of ImportOptions3DM as a copy of the provided import options.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public ImportOptions3DM( 	ImportOptions3DM option ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	option As ImportOptions3DM _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ImportOptions3DM( 	ImportOptions3DM^ option ) ``` |

#### Parameters

option
:   Type:  Autodesk.Revit.DB ImportOptions3DM
     The 3DM import options to be copied.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ImportOptions3DM Class

ImportOptions3DM Overload

Autodesk.Revit.DB Namespace

#### FillColor Property

---

|  |
| --- |
| MEPSystemType Class   See Also |

Indicates the color that should override the fill color for all components in the system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Color FillColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FillColor As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ FillColor { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

MEPSystemType Class

Autodesk.Revit.DB Namespace

#### SpacingJustification Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Justification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacingJustification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacingJustification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacingJustification { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DisjoinedSolidsInInPlaceFamily Property

---

|  |
| --- |
| BuiltInFailures PerformanceFailures Class   See Also |

In-place family contains multiple disjoined solids. Consider splitting in several in-place families.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DisjoinedSolidsInInPlaceFamily { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DisjoinedSolidsInInPlaceFamily As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DisjoinedSolidsInInPlaceFamily { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PerformanceFailures Class

Autodesk.Revit.DB Namespace

#### FamilyFreeinstDefaultElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Default Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FamilyFreeinstDefaultElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyFreeinstDefaultElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FamilyFreeinstDefaultElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DefaultConstructionMassOpening Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mass Opening"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DefaultConstructionMassOpening { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DefaultConstructionMassOpening As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DefaultConstructionMassOpening { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetPointAtStation Method

---

|  |
| --- |
| Alignment Class   See Also |

Calculates the model point for a given alignment station.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public XYZ GetPointAtStation( 	double station ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPointAtStation ( _ 	station As Double _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ GetPointAtStation( 	double station ) ``` |

#### Parameters

station
:   Type:  System Double
     The alignment station for which to calculate the point, in Revit internal model units (standard Imperial feet).

#### Return Value

The model point at the given alignment station.

# See Also

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace

#### BuildingPadNoSurface Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

A Pad can't extend beyond the edge of a Toposurface.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BuildingPadNoSurface { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BuildingPadNoSurface As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BuildingPadNoSurface { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### SpatialFieldMgrResultsVisibility Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Results Visibility"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpatialFieldMgrResultsVisibility { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpatialFieldMgrResultsVisibility As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpatialFieldMgrResultsVisibility { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PropertySegmentNS Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"N/S"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PropertySegmentNS { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PropertySegmentNS As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PropertySegmentNS { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RotationalPointSpringCoefficient Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Rotational Point Spring Coefficient, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RotationalPointSpringCoefficient { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RotationalPointSpringCoefficient As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RotationalPointSpringCoefficient { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### NumberOfCurves Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Returns the number of curves in the curve loop.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2019.1

# Syntax

| C# |
| --- |
| ``` public int NumberOfCurves() ``` |

| Visual Basic |
| --- |
| ``` Public Function NumberOfCurves As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int NumberOfCurves() ``` |

#### Return Value

The number of curves in the curve loop.

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### Schedule Property

---

|  |
| --- |
| ScheduleField Class   See Also |

The schedule that this field belongs to.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ViewSchedule Schedule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Schedule As ViewSchedule 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ViewSchedule^ Schedule { 	ViewSchedule^ get (); } ``` |

# See Also

ScheduleField Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| Transform2D Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

Transform2D Class

Autodesk.Revit.DB Namespace

#### GetUnits Method

---

|  |
| --- |
| PipeFittingAndAccessoryPressureDropUIData Class   See Also |

Gets units.

**Namespace:**   Autodesk.Revit.UI.Plumbing
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public Units GetUnits() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetUnits As Units ``` |

| Visual C++ |
| --- |
| ``` public: Units^ GetUnits() ``` |

#### Return Value

The Units object.

# See Also

PipeFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Plumbing Namespace

#### RoomCalculatedSupplyAirflowParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Calculated Supply Airflow"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomCalculatedSupplyAirflowParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomCalculatedSupplyAirflowParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomCalculatedSupplyAirflowParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ElementView Property

---

|  |
| --- |
| DockablePanes BuiltInDockablePanes Class   See Also |

The element view pane.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static DockablePaneId ElementView { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElementView As DockablePaneId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property DockablePaneId^ ElementView { 	DockablePaneId^ get (); } ``` |

# See Also

DockablePanes BuiltInDockablePanes Class

Autodesk.Revit.UI Namespace

#### GetAnalyticalPropertyData Method

---

|  |
| --- |
| ElectricalAnalyticalNode Class   See Also |

Gets the electrical analytical node property data,    a null reference (  Nothing  in Visual Basic)  if not available.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public AnalyticalDistributionNodePropertyData GetAnalyticalPropertyData() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAnalyticalPropertyData As AnalyticalDistributionNodePropertyData ``` |

| Visual C++ |
| --- |
| ``` public: AnalyticalDistributionNodePropertyData^ GetAnalyticalPropertyData() ``` |

#### Return Value

The electrical analytical node property data.

# Remarks

These types have special data:

* Bus
* TransferSwitch
* EquipmentLoad

# See Also

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace

#### AddSpace Method

---

|  |
| --- |
| IFCProductWrapper Class   See Also |

Adds an IfcSpace handle to associate with the IfcProduct in this wrapper.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void AddSpace( 	IFCAnyHandle spaceHandle, 	IFCLevelInfo pLevelInfo, 	IFCExtrusionCreationData pParams, 	bool relateToLevel ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddSpace ( _ 	spaceHandle As IFCAnyHandle, _ 	pLevelInfo As IFCLevelInfo, _ 	pParams As IFCExtrusionCreationData, _ 	relateToLevel As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddSpace( 	IFCAnyHandle^ spaceHandle,  	IFCLevelInfo^ pLevelInfo,  	IFCExtrusionCreationData^ pParams,  	bool relateToLevel ) ``` |

#### Parameters

spaceHandle
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The IfcSpace handle.

pLevelInfo
:   Type:  Autodesk.Revit.DB.IFC IFCLevelInfo
     Information on the associated level.

pParams
:   Type:  Autodesk.Revit.DB.IFC IFCExtrusionCreationData
     The extrusion creation data associated with the given space. Optional, can be    a null reference (  Nothing  in Visual Basic)  .

relateToLevel
:   Type:  System Boolean
     True to relate the space to the level, false otherwise.

# Remarks

If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace

#### LoadCaseNature Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Nature"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadCaseNature { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadCaseNature As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadCaseNature { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetInputPoints Method

---

|  |
| --- |
| StructuralConnectionHandler Class   See Also |

Returns a list of additional points defining certain connections.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public IList<ConnectionInputPoint> GetInputPoints() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetInputPoints As IList(Of ConnectionInputPoint) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ConnectionInputPoint^>^ GetInputPoints() ``` |

# See Also

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace

#### SectionAttrHeadTag Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Section Head"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SectionAttrHeadTag { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SectionAttrHeadTag As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SectionAttrHeadTag { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SweepProfile Class

---

|  |
| --- |
| Members   See Also |

Represents a profile for sweep or swept blend elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class SweepProfile : APIObject ``` |

| Visual Basic |
| --- |
| ``` Public Class SweepProfile _ 	Inherits APIObject ``` |

| Visual C++ |
| --- |
| ``` public ref class SweepProfile : public APIObject ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB SweepProfile
  Autodesk.Revit.DB CurveLoopsProfile
  Autodesk.Revit.DB FamilySymbolProfile

# See Also

SweepProfile Members

Autodesk.Revit.DB Namespace

#### AreCoordinationModelHandlesHidden Property

---

|  |
| --- |
| View Class   See Also |

Indicates if Coordination Model handles are currently hidden in the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool AreCoordinationModelHandlesHidden { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AreCoordinationModelHandlesHidden As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool AreCoordinationModelHandlesHidden { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

True if Coordination Model handles are currently hidden in the view, false otherwise.

# See Also

View Class

Autodesk.Revit.DB Namespace

#### DialogType Property

---

|  |
| --- |
| MessageBoxShowingEventArgs Class   See Also |

An integer that describes the standard Windows type of the dialog box.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public int DialogType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DialogType As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int DialogType { 	int get (); } ``` |

# See Also

MessageBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### IsFlippedOnFace Method (Face)

---

|  |
| --- |
| Edge Class   See Also |

Determines if this edge's topological direction on the Face is opposite to its parametric direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public bool IsFlippedOnFace( 	Face face ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsFlippedOnFace ( _ 	face As Face _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsFlippedOnFace( 	Face^ face ) ``` |

#### Parameters

face
:   Type:  Autodesk.Revit.DB Face
     The face with respect to which the direction is considered. Must belong to the edge.

#### Return Value

true if this edge's topological direction on the Face is opposite to its parametric direction, false if the topological direction agrees with the parametric direction.

# Remarks

Outer edge loops on a Face are oriented counter-clockwise with respect to the Face's orientation, and inner loops are oriented clockwise. The topological direction of an edge on a face means the direction in which the edge's loop is being traversed.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the specified face is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the specified face is not one of the faces for this edge. |

# See Also

Edge Class

IsFlippedOnFace Overload

Autodesk.Revit.DB Namespace

#### ThermalExpansionCoefficient Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Thermal Expansion Coefficient, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ThermalExpansionCoefficient { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ThermalExpansionCoefficient As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ThermalExpansionCoefficient { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### RbsElecLoadClassification Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Load Classification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecLoadClassification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecLoadClassification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecLoadClassification { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetElementsWithOpenConnector Method

---

|  |
| --- |
| DesignToFabricationConverter Class   See Also |

Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public ISet<ElementId> GetElementsWithOpenConnector() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetElementsWithOpenConnector As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ISet<ElementId^>^ GetElementsWithOpenConnector() ``` |

# Remarks

This set of element identifiers is only available after the  **Convert**  method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.

# See Also

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace

#### PathReinHookTypen1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Primary Bar - Start Hook Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PathReinHookTypen1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinHookTypen1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PathReinHookTypen1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsShapeImporterAvailable Method

---

|  |
| --- |
| OptionalFunctionalityUtils Class   See Also |

Checks whether the ShapeImporter functionality is available in the installed Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static bool IsShapeImporterAvailable() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsShapeImporterAvailable As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsShapeImporterAvailable() ``` |

#### Return Value

True if the ShapeImporter functionality is available in the installed Revit.

# See Also

OptionalFunctionalityUtils Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, ElementId, XYZ, XYZ, LineLoadType)

---

|  |
| --- |
| LineLoad Class   See Also |

Creates a new hosted line load within the project.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static LineLoad Create( 	Document aDoc, 	ElementId hostElemId, 	XYZ forceVector1, 	XYZ momentVector1, 	LineLoadType symbol ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	aDoc As Document, _ 	hostElemId As ElementId, _ 	forceVector1 As XYZ, _ 	momentVector1 As XYZ, _ 	symbol As LineLoadType _ ) As LineLoad ``` |

| Visual C++ |
| --- |
| ``` public: static LineLoad^ Create( 	Document^ aDoc,  	ElementId^ hostElemId,  	XYZ^ forceVector1,  	XYZ^ momentVector1,  	LineLoadType^ symbol ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     Document to which new line load will be added.

hostElemId
:   Type:  Autodesk.Revit.DB ElementId
     The analytical host element for the line Load.

forceVector1
:   Type:  Autodesk.Revit.DB XYZ
     The applied 3d force vector.

momentVector1
:   Type:  Autodesk.Revit.DB XYZ
     The applied 3d moment vector.

symbol
:   Type:  Autodesk.Revit.DB.Structure LineLoadType
     The symbol of the LineLoad. Set    a null reference (  Nothing  in Visual Basic)  to use default type.

#### Return Value

If successful, returns the newly created LineLoad,    a null reference (  Nothing  in Visual Basic)  otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element hostElemId does not exist in the document -or- hostElemId is not permitted for this type of load. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | Thrown when all force and moment vectors are equal zero. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if type could not be set for newly created line load. |

# See Also

LineLoad Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### WhileLoadingFamilyShared Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

While loading shared family '[Family Name]' from family '[Family Name]': [Description]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WhileLoadingFamilyShared { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WhileLoadingFamilyShared As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WhileLoadingFamilyShared { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### KipPerIn Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kip/in, indicating unit Kips per inch.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KipPerIn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KipPerIn As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KipPerIn { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### CabletrayMinbendmultiplierParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bend Radius Multiplier"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CabletrayMinbendmultiplierParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CabletrayMinbendmultiplierParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CabletrayMinbendmultiplierParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsVisibleByDefault Property

---

|  |
| --- |
| Workset Class   See Also |

Whether the workset is visible by default.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool IsVisibleByDefault { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsVisibleByDefault As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsVisibleByDefault { 	bool get (); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | WorksetDefaultVisibilitySettings is not applicable to family documents. |

# See Also

Workset Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ExternalDefinition Class   See Also |

Releases all resources used by the  ExternalDefinition

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ExternalDefinition Class

Autodesk.Revit.DB Namespace

#### StairsTriserTreadNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Tread Number": Count the sequential number of tread in the stair.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsTriserTreadNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsTriserTreadNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsTriserTreadNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DivideVolumesProfilesEdgeMatchForWidthAll Property

---

|  |
| --- |
| BuiltInFailures DPartFailures Class   See Also |

Division family cannot be used with the selected edge condition for all widths of hosts

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthAll { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DivideVolumesProfilesEdgeMatchForWidthAll As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DivideVolumesProfilesEdgeMatchForWidthAll { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DPartFailures Class

Autodesk.Revit.DB Namespace

#### TextureRealWorldOffsetX Property

---

|  |
| --- |
| Wave Class   See Also |

The property labeled "Offset X" from the "Wave" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldOffsetX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldOffsetX As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldOffsetX { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance".

# See Also

Wave Class

Autodesk.Revit.DB.Visual Namespace

#### Export Method (String, String, NavisworksExportOptions)

---

|  |
| --- |
| Document Class   See Also |

Exports a Revit project to the Navisworks .nwc format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Export( 	string folder, 	string name, 	NavisworksExportOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Export ( _ 	folder As String, _ 	name As String, _ 	options As NavisworksExportOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Export( 	String^ folder,  	String^ name,  	NavisworksExportOptions^ options ) ``` |

#### Parameters

folder
:   Type:  System String
     The name of the folder for the exported file.

name
:   Type:  System String
     The name of the exported file. If it doesn't end in '.nwc', this extension will be added automatically.

options
:   Type:  Autodesk.Revit.DB NavisworksExportOptions
     Options which control the contents of the export.

# Remarks

This is an optional functionality that does not have to be installed. The method "OptionalFunctionalityUtils.isNavisworksExporterAvailable()" can be called to check if the exporter is present.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | NullOrEmpty -or- Contains invalid characters. -or- The input options were not valid. Check the exception message for specific details. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Export is temporarily disabled. -or- Exporting is not allowed in the current application mode. |
| Autodesk.Revit.Exceptions InvalidPathArgumentException | The folder does not exist. |
| Autodesk.Revit.Exceptions OperationCanceledException | The export operation is cancelled in event handler. |
| Autodesk.Revit.Exceptions OptionalFunctionalityNotAvailableException | A Navisworks Exporter is not available in the installed Revit. |

# See Also

Document Class

Export Overload

Autodesk.Revit.DB Namespace

#### RectangleLightShape Class

---

|  |
| --- |
| Members   See Also |

This class encapsulates a rectangle light shape.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class RectangleLightShape : LightShape ``` |

| Visual Basic |
| --- |
| ``` Public Class RectangleLightShape _ 	Inherits LightShape ``` |

| Visual C++ |
| --- |
| ``` public ref class RectangleLightShape : public LightShape ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Lighting LightShape
  Autodesk.Revit.DB.Lighting RectangleLightShape

# See Also

RectangleLightShape Members

Autodesk.Revit.DB.Lighting Namespace

#### DistanceTo Method

---

|  |
| --- |
| UV Class   See Also |

Returns the distance from this 2-D point to the specified 2-D point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double DistanceTo( 	UV source ) ``` |

| Visual Basic |
| --- |
| ``` Public Function DistanceTo ( _ 	source As UV _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double DistanceTo( 	UV^ source ) ``` |

#### Parameters

source
:   Type:  Autodesk.Revit.DB UV
     The specified point.

#### Return Value

The real number equal to the distance between the two points.

# Remarks

The distance between the two points is equal to the length of the vector that joins the two points.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when source is    a null reference (  Nothing  in Visual Basic)  . |

# See Also

UV Class

Autodesk.Revit.DB Namespace

#### LabelLineLength Property

---

|  |
| --- |
| Viewport Class   See Also |

The length of the viewport label line in sheet space, measured in feet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public double LabelLineLength { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LabelLineLength As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double LabelLineLength { 	double get (); 	void set (double value); } ``` |

# Remarks

It can be negative. The sign depends on the direction of the label line.

# See Also

Viewport Class

Autodesk.Revit.DB Namespace

#### PrimitiveType Property

---

|  |
| --- |
| IFCData Class   See Also |

The primitive data type.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public IFCDataPrimitiveType PrimitiveType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PrimitiveType As IFCDataPrimitiveType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property IFCDataPrimitiveType PrimitiveType { 	IFCDataPrimitiveType get (); 	void set (IFCDataPrimitiveType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

IFCData Class

Autodesk.Revit.DB.IFC Namespace

#### Clear Method

---

|  |
| --- |
| EdgeArray Class   See Also |

Removes every edge from the array, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

EdgeArray Class

Autodesk.Revit.DB Namespace